MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM363.h"                 /* TMPM363 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma anon_unions 
#elif (defined (__ICCARM__)) 	/*ICC Compiler       */
#pragma language=extended
#endif

/** Device Specific Peripheral registers structures */

/**
  * @brief Single Master DMAC (DMAC)
  */
typedef struct
{
  __I  uint32_t INTSTATUS;           /*!< Offset: 0x000 (R/ )  DMAC Interrupt Status Register                    */
  __I  uint32_t INTTCSTATUS;         /*!< Offset: 0x004 (R/ )  DMAC Interrupt Terminal Count Status Register     */
  __O  uint32_t INTTCCLEAR;          /*!< Offset: 0x008 ( /W)  DMAC Interrupt Terminal Count Clear Register      */
  __I  uint32_t INTERRORSTATUS;      /*!< Offset: 0x00C (R/ )  DMAC Interrupt Error Status Register              */
  __O  uint32_t INTERRCLR;           /*!< Offset: 0x010 ( /W)  DMAC Interrupt Error Clear Register               */
  __I  uint32_t RAWINTTCSTATUS;      /*!< Offset: 0x014 (R/ )  DMAC Raw Interrupt Terminal Count Status Register */
  __I  uint32_t RAWINTERRORSTATUS;   /*!< Offset: 0x018 (R/ )  DMAC Raw Error Interrupt Status Register          */
  __I  uint32_t ENBLDCHNS;           /*!< Offset: 0x01C (R/ )  DMAC Enabled Channel Register                     */
  __IO uint32_t SOFTBREQ;            /*!< Offset: 0x020 (R/W)  DMAC Software Burst Request Register              */
  __IO uint32_t SOFTSREQ;            /*!< Offset: 0x024 (R/W)  DMAC Software Single Request Register             */
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;       /*!< Offset: 0x030 (R/W)  DMAC Configuration Register                       */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;           /*!< Offset: 0x100 (R/W)  DMAC Channel0 Source Address Register             */
  __IO uint32_t C0DESTADDR;          /*!< Offset: 0x104 (R/W)  DMAC Channel0 Destination Address Register        */
  __IO uint32_t C0LLI;               /*!< Offset: 0x108 (R/W)  DMAC Channel0 Linked List Item Register           */
  __IO uint32_t C0CONTROL;           /*!< Offset: 0x10C (R/W)  DMAC Channel0 Control Register                    */
  __IO uint32_t C0CONFIGURATION;     /*!< Offset: 0x110 (R/W)  DMAC Channel0 Configuration Register              */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;           /*!< Offset: 0x120 (R/W)  DMAC Channel1 Source Address Register             */
  __IO uint32_t C1DESTADDR;          /*!< Offset: 0x124 (R/W)  DMAC Channel1 Destination Address Register        */
  __IO uint32_t C1LLI;               /*!< Offset: 0x128 (R/W)  DMAC Channel1 Linked List Item Register           */
  __IO uint32_t C1CONTROL;           /*!< Offset: 0x12C (R/W)  DMAC Channel1 Control Register                    */
  __IO uint32_t C1CONFIGURATION;     /*!< Offset: 0x130 (R/W)  DMAC Channel1 Configuration Register              */
} TSB_DMAC_TypeDef;

/**
  * @brief Static Memory Controller (SMC)
  */
typedef struct
{
       uint32_t RESERVED0;
  __I  uint32_t MEMIF_CFG;           /*!< Offset: 0x004 (R/ )  SMC Memory Interface Configuration Register */
       uint32_t RESERVED1[2];
  __O  uint32_t DIRECT_CMD;          /*!< Offset: 0x010 ( /W)  SMC Direct Command Register                 */
  __O  uint32_t SET_CYCLES;          /*!< Offset: 0x014 ( /W)  SMC Set Cycles Register                     */
  __O  uint32_t SET_OPMODE;          /*!< Offset: 0x018 ( /W)  SMC Set Opmode Register                     */
       uint32_t RESERVED2[57];
  __I  uint32_t SRAM_CYCLES0_0;      /*!< Offset: 0x100 (R/ )  SMC SRAM Cycles Register 0 <0>              */
  __I  uint32_t OPMODE0_0;           /*!< Offset: 0x104 (R/ )  SMC Opmode Register 0 <0>                   */
       uint32_t RESERVED3[6];
  __I  uint32_t SRAM_CYCLES0_1;      /*!< Offset: 0x120 (R/ )  SMC SRAM Cycles Register 0 <1>              */
  __I  uint32_t OPMODE0_1;           /*!< Offset: 0x124 (R/ )  SMC Opmode Register 0 <1>                   */
       uint32_t RESERVED4[6];
  __I  uint32_t SRAM_CYCLES0_2;      /*!< Offset: 0x140 (R/ )  SMC SRAM Cycles Register 0 <2>              */
  __I  uint32_t OPMODE0_2;           /*!< Offset: 0x144 (R/ )  SMC Opmode Register 0 <2>                   */
       uint32_t RESERVED5[6];
  __I  uint32_t SRAM_CYCLES0_3;      /*!< Offset: 0x160 (R/ )  SMC SRAM Cycles Register 0 <3>              */
  __I  uint32_t OPMODE0_3;           /*!< Offset: 0x164 (R/ )  SMC Opmode Register 0 <3>                   */
} TSB_SMC_TypeDef;

/**
  * @brief CAN Controller (TXCAN) Mailbox RAM
  */
typedef struct
{
  __IO uint32_t ID;                    /*!< CAN Mailbox ID                                        */
       uint32_t RESERVED0;
  __IO uint32_t TSVMCF;                /*!< CAN Mailbox Time Stamp Value & Message Control Field  */
       uint32_t RESERVED1;
  __IO uint32_t DL;                    /*!< CAN Mailbox Lower Data Field (D3-D0)                  */
       uint32_t RESERVED2;
  __IO uint32_t DH;                    /*!< CAN Mailbox Upper Data Field (D7-D4)                  */
} TSB_CANMB_TypeDef;

/**
  * @brief CAN Controller (TXCAN)
  */
typedef struct
{
  __IO uint32_t MC;                    /*!< CAN Mailbox Configuration Register            */
       uint32_t RESERVED0;
  __IO uint32_t MD;                    /*!< CAN Mailbox Direction Register                */
       uint32_t RESERVED1;
  __IO uint32_t TRS;                   /*!< CAN Transmit Request Set Register             */
       uint32_t RESERVED2;
  __IO uint32_t TRR;                   /*!< CAN Transmit Request Reset Register           */
       uint32_t RESERVED3;
  __IO uint32_t TA;                    /*!< CAN Transmission Acknowledge Register         */
       uint32_t RESERVED4;
  __IO uint32_t AA;                    /*!< CAN Abort Acknowledge Register                */
       uint32_t RESERVED5;
  __IO uint32_t RMP;                   /*!< CAN Receive Message Pending Register          */
       uint32_t RESERVED6;
  __IO uint32_t RML;                   /*!< CAN Receive Message Lost Register             */
       uint32_t RESERVED7;
  __IO uint32_t LAM;                   /*!< CAN Local Acceptance Mask Register            */
       uint32_t RESERVED8;
  __IO uint32_t GAM;                   /*!< CAN Global Acceptance Mask Register           */
       uint32_t RESERVED9;
  __IO uint32_t MCR;                   /*!< CAN Master Control Register                   */
       uint32_t RESERVED10;
  __I  uint32_t GSR;                   /*!< CAN Global Status Register                    */
       uint32_t RESERVED11;
  __IO uint32_t BCR1;                  /*!< CAN Bit Configuration Register 1              */
       uint32_t RESERVED12;
  __IO uint32_t BCR2;                  /*!< CAN Bit Configuration Register 2              */
       uint32_t RESERVED13;
  __IO uint32_t GIF;                   /*!< CAN Global Interrupt Flag Register            */
       uint32_t RESERVED14;
  __IO uint32_t GIM;                   /*!< CAN Global Interrupt Mask Register            */
       uint32_t RESERVED15;
  __IO uint32_t MBTIF;                 /*!< CAN Mailbox Transmit Interrupt Flag Register  */
       uint32_t RESERVED16;
  __IO uint32_t MBRIF;                 /*!< CAN Mailbox Receive Interrupt Flag Register   */
       uint32_t RESERVED17;
  __IO uint32_t MBIM;                  /*!< CAN Mailbox Interrupt Mask Register           */
       uint32_t RESERVED18;
  __IO uint32_t CDR;                   /*!< CAN Change Data Request                       */
       uint32_t RESERVED19;
  __IO uint32_t RFP;                   /*!< CAN Remote Frame Pending Register             */
       uint32_t RESERVED20;
  __I  uint32_t CECR;                  /*!< CAN CAN Error Counter Register                */
       uint32_t RESERVED21;
  __IO uint32_t TSP;                   /*!< CAN Time Stamp Counter Prescaler              */
       uint32_t RESERVED22;
  __IO uint32_t TSC;                   /*!< CAN Time Stamp Counter                        */
} TSB_CAN_TypeDef;

/**
  * @brief USB Host Controller
  */
typedef struct
{
  __I  uint32_t REVISION;              /*!< USB Host Controller Revision Register                    */
  __IO uint32_t CONTROL;               /*!< USB Host Controller Control Register                     */
  __IO uint32_t COMMANDSTATUS;         /*!< USB Host Controller Command Status Register              */
  __IO uint32_t INTERRUPTSTATUS;       /*!< USB Host Controller Interrupt Status Register            */
  __IO uint32_t INTERRUPTENABLE;       /*!< USB Host Controller Interrupt Enable Register            */
  __IO uint32_t INTERRUPTDISABLE;      /*!< USB Host Controller Interrupt Disable Register           */
  __IO uint32_t HCCA;                  /*!< USB Host Controller Communication Area Register          */
  __I  uint32_t PERIODCURRENTED;       /*!< USB Host Controller Period Current ED Register           */
  __IO uint32_t CONTROLHEADED;         /*!< USB Host Controller Control Head ED Register             */
  __IO uint32_t CONTROLCURRENTED;      /*!< USB Host Controller Control Current ED Register          */
  __IO uint32_t BULKHEADED;            /*!< USB Host Controller Bulk Head ED Register                */
  __IO uint32_t BULKCURRENTED;         /*!< USB Host Controller Bulk Current ED Register             */
  __I  uint32_t DONEHEAD;              /*!< USB Host Controller Done Head Register                   */
  __IO uint32_t FMINTERVAL;            /*!< USB Host Controller Frame Interval Register              */
  __I  uint32_t FMREMAINING;           /*!< USB Host Controller Frame Remaining Register             */
  __I  uint32_t FMNUMBER;              /*!< USB Host Controller Frame Number Register                */
  __IO uint32_t PERIODSTART;           /*!< USB Host Controller Period Start Register                */
  __IO uint32_t LSTHRESHOLD;           /*!< USB Host Controller LS Threshold Register                */
  __IO uint32_t RHDESCRIPTORA;         /*!< USB Host Controller Root Hub Descriptor Register         */
  __IO uint32_t RHDESCRIPTERB;         /*!< USB Host Controller Root Hub Descriptor Register         */
  __IO uint32_t RHSTATUS;              /*!< USB Host Controller Root Hub Status Register             */
  __IO uint32_t RHPORTSTATUS;          /*!< USB Host Controller Root Hub Port Status Register        */
       uint32_t RESERVED0[10];
  __IO uint32_t BCR0;                  /*!< USB Host Controller Clock & Transceiver Control Register */
} TSB_HC_TypeDef;

/**
  * @brief Synchronous Serial Port (SSP)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< Offset: 0x000 (R/W)  SSP Control Register 0                    */
  __IO uint32_t CR1;                /*!< Offset: 0x004 (R/W)  SSP Control Register 1                    */
  __IO uint32_t DR;                 /*!< Offset: 0x008 (R/W)  SSP Data Register                         */
  __I  uint32_t SR;                 /*!< Offset: 0x00C (R/ )  SSP Status Register                       */
  __IO uint32_t CPSR;               /*!< Offset: 0x010 (R/W)  SSP Clock Prescaler Register              */
  __IO uint32_t IMSC;               /*!< Offset: 0x014 (R/W)  SSP Interrupt Mask Set and Clear Register */
  __I  uint32_t RIS;                /*!< Offset: 0x018 (R/ )  SSP Raw Interrupt Status Register         */
  __I  uint32_t MIS;                /*!< Offset: 0x01C (R/ )  SSP Masked Interrupt Status Register      */
  __O  uint32_t ICR;                /*!< Offset: 0x020 ( /W)  SSP Interrupt Clear Register              */
  __IO uint32_t DMACR;              /*!< Offset: 0x024 (R/W)  SSP DMA Control Register                  */
} TSB_SSP_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PA)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PA Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PA Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PA Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PA Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PA Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PA Input Enable Control Register */
} TSB_PA_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PB)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PB Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PB Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PB Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PB Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PB Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PB Input Enable Control Register */
} TSB_PB_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PC)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PC Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PC Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PC Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PC Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PC Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PC Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PC Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PC Input Enable Control Register */
} TSB_PC_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PD)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PD Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PD Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PD Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PD Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PD Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PD Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PD Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PD Input Enable Control Register */
} TSB_PD_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PE)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PE Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PE Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PE Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PE Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PE Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PE Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PE Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PE Input Enable Control Register */
} TSB_PE_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PF)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PF Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PF Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PF Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PF Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PF Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PF Input Enable Control Register */
} TSB_PF_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PG)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PG Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PG Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PG Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PG Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PG Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PG Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PG Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PG Input Enable Control Register */
} TSB_PG_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PH)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PH Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PH Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PH Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PH Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PH Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PH Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PH Input Enable Control Register */
} TSB_PH_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PI)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PI Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PI Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PI Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PI Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PI Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PI Input Enable Control Register */
} TSB_PI_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PJ)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PJ Data Register                 */
       uint32_t RESERVED0[2];
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PJ Function Register 2           */
       uint32_t RESERVED1[7];
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PJ Pull-Up Control Register      */
       uint32_t RESERVED2[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PJ Input Enable Control Register */
} TSB_PJ_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PK)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PK Data Register                 */
       uint32_t RESERVED0[10];
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PK Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PK Input Enable Control Register */
} TSB_PK_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PL)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PL Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PL Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PL Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PL Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PL Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PL Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PL Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PL Input Enable Control Register */
} TSB_PL_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PM)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PM Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PM Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PM Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PM Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PM Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PM Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PM Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PM Input Enable Control Register */
} TSB_PM_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PN)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PN Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PN Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PN Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PN Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PN Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PN Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PN Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PN Input Enable Control Register */
} TSB_PN_TypeDef;

