MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/**
  * @brief General Purpose Input/Output Port (PO)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PO Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PO Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PO Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PO Function Register 2           */
  __IO uint32_t FR3;                /*!< Offset: 0x010 (R/W)  PO Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PO Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PO Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PO Input Enable Control Register */
} TSB_PO_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PP)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x000 (R/W)  PP Data Register                 */
  __IO uint32_t CR;                 /*!< Offset: 0x004 (R/W)  PP Control Register              */
  __IO uint32_t FR1;                /*!< Offset: 0x008 (R/W)  PP Function Register 1           */
  __IO uint32_t FR2;                /*!< Offset: 0x00C (R/W)  PP Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;                 /*!< Offset: 0x028 (R/W)  PP Open Drain Control Register   */
  __IO uint32_t PUP;                /*!< Offset: 0x02C (R/W)  PP Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Offset: 0x038 (R/W)  PP Input Enable Control Register */
} TSB_PP_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x000 (R/W)  Timer Enable Register */               
  __IO uint32_t RUN;                /*!< Offset: 0x004 (R/W)  Timer RUN Register */
  __IO uint32_t CR;                 /*!< Offset: 0x008 (R/W)  Timer Control Register */
  __IO uint32_t MOD;                /*!< Offset: 0x00C (R/W)  Timer Mode Register */
  __IO uint32_t FFCR;               /*!< Offset: 0x010 (R/W)  Timer Flip-Flop Control Register */
  __IO uint32_t ST;                 /*!< Offset: 0x014 (R/W)  Timer Status Register */
  __IO uint32_t IM;                 /*!< Offset: 0x018 (R/W)  Interrupt Mask Register */
  __IO uint32_t UC;                 /*!< Offset: 0x01C (R/W)  Timer Up Counter Register */
  __IO uint32_t RG0;                /*!< Offset: 0x020 (R/W)  Timer Register 0 */
  __IO uint32_t RG1;                /*!< Offset: 0x024 (R/W)  Timer Register 1 */
  __IO uint32_t CP0;                /*!< Offset: 0x028 (R/W)  Capture register 0 */
  __IO uint32_t CP1;                /*!< Offset: 0x02C (R/W)  Capture register 1 */
} TSB_TB_TypeDef;

/**
  * @brief Serial Bus Interface (SBI)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< Offset: 0x000 (R/W)  SBI Control Register 0 */
  __IO uint32_t CR1;                /*!< Offset: 0x004 (R/W)  SBI Control register 1 */
  __IO uint32_t DBR;                /*!< Offset: 0x008 (R/W)  SBI Data Buffer Register */
  __IO uint32_t I2CAR;              /*!< Offset: 0x00C (R/W)  I2C Bus Address Register */
  union {
  __O  uint32_t CR2;                /*!< Offset: 0x010 ( /W)  SBI Control Register 2 */
  __I  uint32_t SR;                 /*!< Offset: 0x010 (R/ )  SBI Status Register */
  };
  __IO uint32_t BR0;                /*!< Offset: 0x014 (R/W)  Baud Rate Register 0 */
} TSB_SBI_TypeDef;

/**
  * @brief Serial Channel (SC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x000 (R/W)  SIO Enable Register */
  __IO uint32_t BUF;                /*!< Offset: 0x004 (R/W)  SIO Transmit/ Receive Buffer Register */
  __IO uint32_t CR;                 /*!< Offset: 0x008 (R/W)  SIO Control Register */
  __IO uint32_t MOD0;               /*!< Offset: 0x00C (R/W)  SIO Mode Control Register 0 */
  __IO uint32_t BRCR;               /*!< Offset: 0x010 (R/W)  SIO Baud Rate Generator Control */
  __IO uint32_t BRADD;              /*!< Offset: 0x014 (R/W)  SIO Baud rate Generator Control 2 */
  __IO uint32_t MOD1;               /*!< Offset: 0x018 (R/W)  SIO Mode Control Register 1 */
  __IO uint32_t MOD2;               /*!< Offset: 0x01C (R/W)  SIO Mode Control Register 2 */
  __IO uint32_t RFC;                /*!< Offset: 0x020 (R/W)  SIO Receive FIFO Configuration Register */
  __IO uint32_t TFC;                /*!< Offset: 0x024 (R/W)  SIO Transmit FIFO Configuration Register */
  __I  uint32_t RST;                /*!< Offset: 0x028 (R/W)  SIO Receive FIFO Status Register */
  __I  uint32_t TST;                /*!< Offset: 0x02C (R/W)  SIO Transmit FIFO Status Register */
  __IO uint8_t  FCNF;               /*!< Offset: 0x030 (R/W)  SIO FIFO Configuration Register */
} TSB_SC_TypeDef;

/**
  * @brief Consumer Electronics Control (CEC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x000 (R/W)  CEC Enable Register                    */
  __IO uint32_t ADD;                /*!< Offset: 0x004 (R/W)  CEC Logical Address Register           */
  __O  uint32_t RESET;              /*!< Offset: 0x008 ( /W)  CEC Software Reset Register            */
  __IO uint32_t REN;                /*!< Offset: 0x00C (R/W)  CEC Receive Enable Register            */
  __I  uint32_t RBUF;               /*!< Offset: 0x010 (R/ )  CEC Receive Buffer Register            */
  __IO uint32_t RCR1;               /*!< Offset: 0x014 (R/W)  CEC Receive Control Register 1         */
  __IO uint32_t RCR2;               /*!< Offset: 0x018 (R/W)  CEC Receive Control Register 2         */
  __IO uint32_t RCR3;               /*!< Offset: 0x01C (R/W)  CEC Receive Control Register 3         */
  __IO uint32_t TEN;                /*!< Offset: 0x020 (R/W)  CEC Transmit Enable Register           */
  __IO uint32_t TBUF;               /*!< Offset: 0x024 (R/W)  CEC Transmit Buffer Register           */
  __IO uint32_t TCR;                /*!< Offset: 0x028 (R/W)  CEC Transmit Control Register          */
  __I  uint32_t RSTAT;              /*!< Offset: 0x02C (R/ )  CEC Receive Interrupt Status Register  */
  __I  uint32_t TSTAT;              /*!< Offset: 0x030 (R/ )  CEC Transmit Interrupt Status Register */
  __IO uint32_t FSSEL;              /*!< Offset: 0x034 (R/W)  RMC Frequency Select Register      */
} TSB_CEC_TypeDef;

/**
  * @brief Remote Control Signal Preprocessor (RMC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x000 (R/W)  RMC Enable Register                */
  __IO uint32_t REN;                /*!< Offset: 0x004 (R/W)  RMC Receive Enable Register        */
  __I  uint32_t RBUF1;              /*!< Offset: 0x008 (R/W)  RMC Receive Data Buffer Register 1 */
  __I  uint32_t RBUF2;              /*!< Offset: 0x00C (R/W)  RMC Receive Data Buffer Register 2 */
  __I  uint32_t RBUF3;              /*!< Offset: 0x010 (R/W)  RMC Receive Data Buffer Register 3 */
  __IO uint32_t RCR1;               /*!< Offset: 0x014 (R/W)  RMC Receive Control Register 1     */
  __IO uint32_t RCR2;               /*!< Offset: 0x018 (R/W)  RMC Receive Control Register 2     */
  __IO uint32_t RCR3;               /*!< Offset: 0x01C (R/W)  RMC Receive Control Register 3     */
  __IO uint32_t RCR4;               /*!< Offset: 0x020 (R/W)  RMC Receive Control Register 4     */
  __I  uint32_t RSTAT;              /*!< Offset: 0x024 (R/W)  RMC Receive Status Register        */
  __IO uint32_t END1;               /*!< Offset: 0x028 (R/W)  RMC Receive bit Number Register 1  */
  __IO uint32_t END2;               /*!< Offset: 0x02C (R/W)  RMC Receive bit Number Register 2  */
  __IO uint32_t END3;               /*!< Offset: 0x030 (R/W)  RMC Receive bit Number Register 3  */
  __IO uint32_t FSSEL;              /*!< Offset: 0x034 (R/W)  RMC Frequency Select Register      */
} TSB_RMC_TypeDef;

/**
  * @brief Analog-to-Digital Converter (AD)
  */
typedef struct
{
  __IO uint32_t CLK;                /*!< Offset: 0x000 (R/W)  AD Conversion Clock Setting Register */
  __IO uint32_t MOD0;               /*!< Offset: 0x004 (R/W)  AD Mode Control Register 0 */
  __IO uint32_t MOD1;               /*!< Offset: 0x008 (R/W)  AD Mode Control Register 1 */
  __IO uint32_t MOD2;               /*!< Offset: 0x00C (R/W)  AD Mode Control Register 2 */
  __IO uint32_t MOD3;               /*!< Offset: 0x010 (R/W)  AD Mode Control Register 3 */
  __IO uint32_t MOD4;               /*!< Offset: 0x014 (R/W)  AD Mode Control Register 4 */
  __IO uint32_t MOD5;               /*!< Offset: 0x018 (R/W)  AD Mode Control Register 5 */
       uint32_t RESERVED0;
  __IO uint32_t CBAS;               /*!< Offset: 0x020 (R/W)  AD Conversion Accuracy Setting Register */
       uint32_t RESERVED1[3];
  __I  uint32_t REG08;              /*!< Offset: 0x030 (R/ )  AD Conversion Result Register 08 */
  __I  uint32_t REG19;              /*!< Offset: 0x034 (R/ )  AD Conversion Result Register 19 */
  __I  uint32_t REG2A;              /*!< Offset: 0x038 (R/ )  AD Conversion Result Register 2A */
  __I  uint32_t REG3B;              /*!< Offset: 0x03C (R/ )  AD Conversion Result Register 3B */
  __I  uint32_t REG4C;              /*!< Offset: 0x040 (R/ )  AD Conversion Result Register 4C */
  __I  uint32_t REG5D;              /*!< Offset: 0x044 (R/ )  AD Conversion Result Register 5D */
  __I  uint32_t REG6E;              /*!< Offset: 0x048 (R/ )  AD Conversion Result Register 6E */
  __I  uint32_t REG7F;              /*!< Offset: 0x04C (R/ )  AD Conversion Result Register 7F */
  __I  uint32_t REGSP;              /*!< Offset: 0x060 (R/ )  AD Conversion Result Register SP */
  __IO uint32_t CMP0;               /*!< Offset: 0x064 (R/W)  AD Conversion Result Comparison Register 0 */
  __IO uint32_t CMP1;               /*!< Offset: 0x068 (R/W)  AD Conversion Result Comparison Register 1 */
} TSB_AD_TypeDef;

/**
  * @brief Key on Wake Up (KWUP)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< Offset: 0x000 (R/W)  KWUP Control Register 0                    */
  __IO uint32_t CR1;                /*!< Offset: 0x004 (R/W)  KWUP Control Register 1                    */
  __IO uint32_t CR2;                /*!< Offset: 0x008 (R/W)  KWUP Control Register 2                    */
  __IO uint32_t CR3;                /*!< Offset: 0x00C (R/W)  KWUP Control Register 3                    */
       uint32_t RESERVED0[28];
  __I  uint32_t PKEY;               /*!< Offset: 0x080 (R/ )  KWUP Port Monitor Register                 */
  __IO uint32_t CNT;                /*!< Offset: 0x084 (R/W)  KWUP Pull-up Cycle Control Register        */
  __O  uint32_t CLR;                /*!< Offset: 0x088 ( /W)  KWUP Interrupt Request All Clear Register  */
  __I  uint32_t INT;                /*!< Offset: 0x08C (R/ )  KWUP Interrupt Monitor Register            */
} TSB_KWUP_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t MOD;                /*!< Offset: 0x000 (R/W)  WDT Mode Register */
  __O  uint32_t CR;                 /*!< Offset: 0x004 ( /W)  WDT Control Register */
} TSB_WD_TypeDef;

/**
  * @brief Real Time Clock (RTC)
  */
typedef struct
{
  __IO uint8_t SECR;                /*!< Offset: 0x000 (R/W)  RTC Second Column Register */
  __IO uint8_t MINR;                /*!< Offset: 0x001 (R/W)  RTC Minute Column Register */
  __IO uint8_t HOURR;               /*!< Offset: 0x002 (R/W)  RTC Hour Column Register */
       uint8_t RESERVED0[1];
  __IO uint8_t DAYR;                /*!< Offset: 0x004 (R/W)  RTC Day of the Week Column Register */
  __IO uint8_t DATER;               /*!< Offset: 0x005 (R/W)  RTC Day Column Register */
  __IO uint8_t MONTHR;              /*!< Offset: 0x006 (R/W)  RTC Month Column Register */
  __IO uint8_t YEARR;               /*!< Offset: 0x007 (R/W)  RTC Year Column Register */
  __IO uint8_t PAGER;               /*!< Offset: 0x008 (R/W)  RTC PAGE Register */
       uint8_t RESERVED1[3];
  __IO uint8_t RESTR;               /*!< Offset: 0x00C (R/W)  RTC Reset Register */
} TSB_RTC_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t SYSCR;              /*!< Offset: 0x000 (R/W)  System Control Register */
  __IO uint32_t OSCCR;              /*!< Offset: 0x004 (R/W)  Oscillation Control Register */
  __IO uint32_t STBYCR;             /*!< Offset: 0x008 (R/W)  Standby Control Register */
  __IO uint32_t PLLSEL;             /*!< Offset: 0x00C (R/W)  PLL Selection Register */
  __IO uint32_t CKSEL;              /*!< Offset: 0x010 (R/W)  System Clock Selection Register */
  __IO uint32_t ICRCG;              /*!< Offset: 0x014 (R/W)  CG Interrupt Request Clear Register (wr) */
  __IO uint32_t NMIFLG;             /*!< Offset: 0x018 (R/W)  NMI Flag Register (rd) */
  __IO uint32_t RSTFLG;             /*!< Offset: 0x01C (R/W)  Reset Flag Register */
  __IO uint32_t IMCGA;              /*!< Offset: 0x020 (R/W)  CG Interrupt Mode Control Register A */
  __IO uint32_t IMCGB;              /*!< Offset: 0x024 (R/W)  CG Interrupt Mode Control Register B */
  __IO uint32_t IMCGC;              /*!< Offset: 0x028 (R/W)  CG Interrupt Mode Control Register C */
  __IO uint32_t IMCGD;              /*!< Offset: 0x02C (R/W)  CG Interrupt Mode Control Register D */
  __IO uint32_t IMCGE;              /*!< Offset: 0x030 (R/W)  CG Interrupt Mode Control Register E */
  __IO uint32_t IMCGF;              /*!< Offset: 0x034 (R/W)  CG Interrupt Mode Control Register F */
} TSB_CG_TypeDef;

/**
  * @brief Flash Control (FC)
  */
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t SECBIT;             /*!< Offset: 0x010 (R/W)  Security Bit Register */
       uint32_t RESERVED1[3];
  __I  uint32_t FLCS;               /*!< Offset: 0x020 (R/ )  Flash Control Register */
} TSB_FC_TypeDef;

/**
  * @brief RAM Controller (RAMC)
  */
typedef struct
{
  __IO uint32_t WAIT;               /*!< Offset: 0x010 (R/W)  RAM WAIT Control Register */
} TSB_RC_TypeDef;

/**
  * @brief SMC MODE Register
  */ 
typedef struct
{
  __IO uint32_t MODE;               /*!< Offset: 0x010 (R/W)  SMC MODE Register */
} TSB_SMCMD_TypeDef;


