MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
#if defined ( __CC_ARM   )     /* RealView Compiler  */
#pragma no_anon_unions
#elif (defined (__ICCARM__))   /* ICC Compiler 	     */
#pragma language=default
#endif


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)

#define TSB_DMAC_BASE        (PERI_BASE  + 0x00000UL)
#define TSB_SMC_BASE         (PERI_BASE  + 0x01000UL)
#define TSB_CANMB0_BASE      (PERI_BASE  + 0x02000UL)
#define TSB_CANMB1_BASE      (PERI_BASE  + 0x02020UL)
#define TSB_CANMB2_BASE      (PERI_BASE  + 0x02040UL)
#define TSB_CANMB3_BASE      (PERI_BASE  + 0x02060UL)
#define TSB_CANMB4_BASE      (PERI_BASE  + 0x02080UL)
#define TSB_CANMB5_BASE      (PERI_BASE  + 0x020A0UL)
#define TSB_CANMB6_BASE      (PERI_BASE  + 0x020C0UL)
#define TSB_CANMB7_BASE      (PERI_BASE  + 0x020E0UL)
#define TSB_CANMB8_BASE      (PERI_BASE  + 0x02100UL)
#define TSB_CANMB9_BASE      (PERI_BASE  + 0x02120UL)
#define TSB_CANMB10_BASE     (PERI_BASE  + 0x02140UL)
#define TSB_CANMB11_BASE     (PERI_BASE  + 0x02160UL)
#define TSB_CANMB12_BASE     (PERI_BASE  + 0x02180UL)
#define TSB_CANMB13_BASE     (PERI_BASE  + 0x021A0UL)
#define TSB_CANMB14_BASE     (PERI_BASE  + 0x021C0UL)
#define TSB_CANMB15_BASE     (PERI_BASE  + 0x021E0UL)
#define TSB_CANMB16_BASE     (PERI_BASE  + 0x02200UL)
#define TSB_CANMB17_BASE     (PERI_BASE  + 0x02220UL)
#define TSB_CANMB18_BASE     (PERI_BASE  + 0x02240UL)
#define TSB_CANMB19_BASE     (PERI_BASE  + 0x02260UL)
#define TSB_CANMB20_BASE     (PERI_BASE  + 0x02280UL)
#define TSB_CANMB21_BASE     (PERI_BASE  + 0x022A0UL)
#define TSB_CANMB22_BASE     (PERI_BASE  + 0x022C0UL)
#define TSB_CANMB23_BASE     (PERI_BASE  + 0x022E0UL)
#define TSB_CANMB24_BASE     (PERI_BASE  + 0x02300UL)
#define TSB_CANMB25_BASE     (PERI_BASE  + 0x02320UL)
#define TSB_CANMB26_BASE     (PERI_BASE  + 0x02340UL)
#define TSB_CANMB27_BASE     (PERI_BASE  + 0x02360UL)
#define TSB_CANMB28_BASE     (PERI_BASE  + 0x02380UL)
#define TSB_CANMB29_BASE     (PERI_BASE  + 0x023A0UL)
#define TSB_CANMB30_BASE     (PERI_BASE  + 0x023C0UL)
#define TSB_CANMB31_BASE     (PERI_BASE  + 0x023E0UL)
#define TSB_CAN_BASE         (PERI_BASE  + 0x02400UL)
#define TSB_HC_BASE          (PERI_BASE  + 0x03000UL)
#define TSB_SSP_BASE         (PERI_BASE  + 0x40000UL)
#define TSB_PA_BASE          (PERI_BASE  + 0xC0000UL)
#define TSB_PB_BASE          (PERI_BASE  + 0xC0100UL)
#define TSB_PC_BASE          (PERI_BASE  + 0xC0200UL)
#define TSB_PD_BASE          (PERI_BASE  + 0xC0300UL)
#define TSB_PE_BASE          (PERI_BASE  + 0xC0400UL)
#define TSB_PF_BASE          (PERI_BASE  + 0xC0500UL)
#define TSB_PG_BASE          (PERI_BASE  + 0xC0600UL)
#define TSB_PH_BASE          (PERI_BASE  + 0xC0700UL)
#define TSB_PI_BASE          (PERI_BASE  + 0xC0800UL)
#define TSB_PJ_BASE          (PERI_BASE  + 0xC0900UL)
#define TSB_PK_BASE          (PERI_BASE  + 0xC0A00UL)
#define TSB_PL_BASE          (PERI_BASE  + 0xC0B00UL)
#define TSB_PM_BASE          (PERI_BASE  + 0xC0C00UL)
#define TSB_PN_BASE          (PERI_BASE  + 0xC0D00UL)
#define TSB_PO_BASE          (PERI_BASE  + 0xC0E00UL)
#define TSB_PP_BASE          (PERI_BASE  + 0xC0F00UL)
#define TSB_TB0_BASE         (PERI_BASE  + 0xD0000UL)
#define TSB_TB1_BASE         (PERI_BASE  + 0xD0100UL)
#define TSB_TB2_BASE         (PERI_BASE  + 0xD0200UL)
#define TSB_TB3_BASE         (PERI_BASE  + 0xD0300UL)
#define TSB_TB4_BASE         (PERI_BASE  + 0xD0400UL)
#define TSB_TB5_BASE         (PERI_BASE  + 0xD0500UL)
#define TSB_TB6_BASE         (PERI_BASE  + 0xD0600UL)
#define TSB_TB7_BASE         (PERI_BASE  + 0xD0700UL)
#define TSB_TB8_BASE         (PERI_BASE  + 0xD0800UL)
#define TSB_TB9_BASE         (PERI_BASE  + 0xD0900UL)
#define TSB_TBA_BASE         (PERI_BASE  + 0xD0A00UL)
#define TSB_TBB_BASE         (PERI_BASE  + 0xD0B00UL)
#define TSB_TBC_BASE         (PERI_BASE  + 0xD0C00UL)
#define TSB_TBD_BASE         (PERI_BASE  + 0xD0D00UL)
#define TSB_TBE_BASE         (PERI_BASE  + 0xD0E00UL)
#define TSB_TBF_BASE         (PERI_BASE  + 0xD0F00UL)
#define TSB_SBI0_BASE        (PERI_BASE  + 0xE0000UL)
#define TSB_SBI1_BASE        (PERI_BASE  + 0xE0100UL)
#define TSB_SBI2_BASE        (PERI_BASE  + 0xE0200UL)
#define TSB_SBI3_BASE        (PERI_BASE  + 0xE0300UL)
#define TSB_SC0_BASE         (PERI_BASE  + 0xE1000UL)
#define TSB_SC1_BASE         (PERI_BASE  + 0xE1100UL)
#define TSB_SC2_BASE         (PERI_BASE  + 0xE1200UL)
#define TSB_SC3_BASE         (PERI_BASE  + 0xE1300UL)
#define TSB_SC4_BASE         (PERI_BASE  + 0xE1400UL)
#define TSB_CEC_BASE         (PERI_BASE  + 0xE2000UL)
#define TSB_RMC0_BASE        (PERI_BASE  + 0xE3000UL)
#define TSB_AD_BASE          (PERI_BASE  + 0xF0000UL)
#define TSB_KWUP_BASE        (PERI_BASE  + 0xF1000UL)
#define TSB_WD_BASE          (PERI_BASE  + 0xF2000UL)
#define TSB_RTC_BASE         (PERI_BASE  + 0xF3000UL)
#define TSB_CG_BASE          (PERI_BASE  + 0xF4000UL)
#define TSB_FC_BASE          (PERI_BASE  + 0x1FFF000UL)
#define TSB_RC_BASE          (PERI_BASE  + 0x1FFF058UL)
#define TSB_SMCMD_BASE       (PERI_BASE  + 0x1FFF100UL)

/* Peripheral declaration */
#define TSB_DMAC             ((   TSB_DMAC_TypeDef *)     TSB_DMAC_BASE)
#define TSB_SMC              ((    TSB_SMC_TypeDef *)      TSB_SMC_BASE)
#define TSB_CANMB0           ((  TSB_CANMB_TypeDef *)   TSB_CANMB0_BASE)
#define TSB_CANMB1           ((  TSB_CANMB_TypeDef *)   TSB_CANMB1_BASE)
#define TSB_CANMB2           ((  TSB_CANMB_TypeDef *)   TSB_CANMB2_BASE)
#define TSB_CANMB3           ((  TSB_CANMB_TypeDef *)   TSB_CANMB3_BASE)
#define TSB_CANMB4           ((  TSB_CANMB_TypeDef *)   TSB_CANMB4_BASE)
#define TSB_CANMB5           ((  TSB_CANMB_TypeDef *)   TSB_CANMB5_BASE)
#define TSB_CANMB6           ((  TSB_CANMB_TypeDef *)   TSB_CANMB6_BASE)
#define TSB_CANMB7           ((  TSB_CANMB_TypeDef *)   TSB_CANMB7_BASE)
#define TSB_CANMB8           ((  TSB_CANMB_TypeDef *)   TSB_CANMB8_BASE)
#define TSB_CANMB9           ((  TSB_CANMB_TypeDef *)   TSB_CANMB9_BASE)
#define TSB_CANMB10          ((  TSB_CANMB_TypeDef *)  TSB_CANMB10_BASE)
#define TSB_CANMB11          ((  TSB_CANMB_TypeDef *)  TSB_CANMB11_BASE)
#define TSB_CANMB12          ((  TSB_CANMB_TypeDef *)  TSB_CANMB12_BASE)
#define TSB_CANMB13          ((  TSB_CANMB_TypeDef *)  TSB_CANMB13_BASE)
#define TSB_CANMB14          ((  TSB_CANMB_TypeDef *)  TSB_CANMB14_BASE)
#define TSB_CANMB15          ((  TSB_CANMB_TypeDef *)  TSB_CANMB15_BASE)
#define TSB_CANMB16          ((  TSB_CANMB_TypeDef *)  TSB_CANMB16_BASE)
#define TSB_CANMB17          ((  TSB_CANMB_TypeDef *)  TSB_CANMB17_BASE)
#define TSB_CANMB18          ((  TSB_CANMB_TypeDef *)  TSB_CANMB18_BASE)
#define TSB_CANMB19          ((  TSB_CANMB_TypeDef *)  TSB_CANMB19_BASE)
#define TSB_CANMB20          ((  TSB_CANMB_TypeDef *)  TSB_CANMB20_BASE)
#define TSB_CANMB21          ((  TSB_CANMB_TypeDef *)  TSB_CANMB21_BASE)
#define TSB_CANMB22          ((  TSB_CANMB_TypeDef *)  TSB_CANMB22_BASE)
#define TSB_CANMB23          ((  TSB_CANMB_TypeDef *)  TSB_CANMB23_BASE)
#define TSB_CANMB24          ((  TSB_CANMB_TypeDef *)  TSB_CANMB24_BASE)
#define TSB_CANMB25          ((  TSB_CANMB_TypeDef *)  TSB_CANMB25_BASE)
#define TSB_CANMB26          ((  TSB_CANMB_TypeDef *)  TSB_CANMB26_BASE)
#define TSB_CANMB27          ((  TSB_CANMB_TypeDef *)  TSB_CANMB27_BASE)
#define TSB_CANMB28          ((  TSB_CANMB_TypeDef *)  TSB_CANMB28_BASE)
#define TSB_CANMB29          ((  TSB_CANMB_TypeDef *)  TSB_CANMB29_BASE)
#define TSB_CANMB30          ((  TSB_CANMB_TypeDef *)  TSB_CANMB30_BASE)
#define TSB_CANMB31          ((  TSB_CANMB_TypeDef *)  TSB_CANMB31_BASE)
#define TSB_CAN              ((    TSB_CAN_TypeDef *)      TSB_CAN_BASE)
#define TSB_HC               ((     TSB_HC_TypeDef *)       TSB_HC_BASE)
#define TSB_SSP              ((    TSB_SSP_TypeDef *)      TSB_SSP_BASE)
#define TSB_PA               ((     TSB_PA_TypeDef *)       TSB_PA_BASE)
#define TSB_PB               ((     TSB_PB_TypeDef *)       TSB_PB_BASE)
#define TSB_PC               ((     TSB_PC_TypeDef *)       TSB_PC_BASE)
#define TSB_PD               ((     TSB_PD_TypeDef *)       TSB_PD_BASE)
#define TSB_PE               ((     TSB_PE_TypeDef *)       TSB_PE_BASE)
#define TSB_PF               ((     TSB_PF_TypeDef *)       TSB_PF_BASE)
#define TSB_PG               ((     TSB_PG_TypeDef *)       TSB_PG_BASE)
#define TSB_PH               ((     TSB_PH_TypeDef *)       TSB_PH_BASE)
#define TSB_PI               ((     TSB_PI_TypeDef *)       TSB_PI_BASE)
#define TSB_PJ               ((     TSB_PJ_TypeDef *)       TSB_PJ_BASE)
#define TSB_PK               ((     TSB_PK_TypeDef *)       TSB_PK_BASE)
#define TSB_PL               ((     TSB_PL_TypeDef *)       TSB_PL_BASE)
#define TSB_PM               ((     TSB_PM_TypeDef *)       TSB_PM_BASE)
#define TSB_PN               ((     TSB_PN_TypeDef *)       TSB_PN_BASE)
#define TSB_PO               ((     TSB_PO_TypeDef *)       TSB_PO_BASE)
#define TSB_PP               ((     TSB_PP_TypeDef *)       TSB_PP_BASE)
#define TSB_TB0              ((     TSB_TB_TypeDef *)      TSB_TB0_BASE)
#define TSB_TB1              ((     TSB_TB_TypeDef *)      TSB_TB1_BASE)
#define TSB_TB2              ((     TSB_TB_TypeDef *)      TSB_TB2_BASE)
#define TSB_TB3              ((     TSB_TB_TypeDef *)      TSB_TB3_BASE)
#define TSB_TB4              ((     TSB_TB_TypeDef *)      TSB_TB4_BASE)
#define TSB_TB5              ((     TSB_TB_TypeDef *)      TSB_TB5_BASE)
#define TSB_TB6              ((     TSB_TB_TypeDef *)      TSB_TB6_BASE)
#define TSB_TB7              ((     TSB_TB_TypeDef *)      TSB_TB7_BASE)
#define TSB_TB8              ((     TSB_TB_TypeDef *)      TSB_TB8_BASE)
#define TSB_TB9              ((     TSB_TB_TypeDef *)      TSB_TB9_BASE)
#define TSB_TBA              ((     TSB_TB_TypeDef *)      TSB_TBA_BASE)
#define TSB_TBB              ((     TSB_TB_TypeDef *)      TSB_TBB_BASE)
#define TSB_TBC              ((     TSB_TB_TypeDef *)      TSB_TBC_BASE)
#define TSB_TBD              ((     TSB_TB_TypeDef *)      TSB_TBD_BASE)
#define TSB_TBE              ((     TSB_TB_TypeDef *)      TSB_TBE_BASE)
#define TSB_TBF              ((     TSB_TB_TypeDef *)      TSB_TBF_BASE)
#define TSB_SBI0             ((    TSB_SBI_TypeDef *)     TSB_SBI0_BASE)
#define TSB_SBI1             ((    TSB_SBI_TypeDef *)     TSB_SBI1_BASE)
#define TSB_SBI2             ((    TSB_SBI_TypeDef *)     TSB_SBI2_BASE)
#define TSB_SBI3             ((    TSB_SBI_TypeDef *)     TSB_SBI3_BASE)
#define TSB_SC0              ((     TSB_SC_TypeDef *)      TSB_SC0_BASE)
#define TSB_SC1              ((     TSB_SC_TypeDef *)      TSB_SC1_BASE)
#define TSB_SC2              ((     TSB_SC_TypeDef *)      TSB_SC2_BASE)
#define TSB_SC3              ((     TSB_SC_TypeDef *)      TSB_SC3_BASE)
#define TSB_SC4              ((     TSB_SC_TypeDef *)      TSB_SC4_BASE)
#define TSB_CEC              ((    TSB_CEC_TypeDef *)      TSB_CEC_BASE)
#define TSB_RMC0             ((    TSB_RMC_TypeDef *)     TSB_RMC0_BASE)
#define TSB_AD               ((     TSB_AD_TypeDef *)       TSB_AD_BASE)
#define TSB_KWUP             ((   TSB_KWUP_TypeDef *)     TSB_KWUP_BASE)
#define TSB_WD               ((     TSB_WD_TypeDef *)       TSB_WD_BASE)
#define TSB_RTC              ((    TSB_RTC_TypeDef *)      TSB_RTC_BASE)
#define TSB_CG               ((     TSB_CG_TypeDef *)       TSB_CG_BASE)
#define TSB_FC               ((     TSB_FC_TypeDef *)       TSB_FC_BASE)
#define TSB_RC               ((     TSB_RC_TypeDef *)       TSB_RC_BASE)
#define TSB_SMCMD            ((  TSB_SMCMD_TypeDef *)    TSB_SMCMD_BASE)

/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))

/* CAN Controller (TXCAN) Mailbox RAM */
#define TSB_CANMB0_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,29)))
#define TSB_CANMB0_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,30)))
#define TSB_CANMB0_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,31)))
#define TSB_CANMB0_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->TSVMCF,4)))

