MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* CAN Controller (TXCAN) */
#define TSB_CAN_MC_MC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,0)))
#define TSB_CAN_MC_MC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,1)))
#define TSB_CAN_MC_MC2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,2)))
#define TSB_CAN_MC_MC3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,3)))
#define TSB_CAN_MC_MC4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,4)))
#define TSB_CAN_MC_MC5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,5)))
#define TSB_CAN_MC_MC6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,6)))
#define TSB_CAN_MC_MC7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,7)))
#define TSB_CAN_MC_MC8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,8)))
#define TSB_CAN_MC_MC9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,9)))
#define TSB_CAN_MC_MC10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,10)))
#define TSB_CAN_MC_MC11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,11)))
#define TSB_CAN_MC_MC12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,12)))
#define TSB_CAN_MC_MC13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,13)))
#define TSB_CAN_MC_MC14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,14)))
#define TSB_CAN_MC_MC15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,15)))
#define TSB_CAN_MC_MC16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,16)))
#define TSB_CAN_MC_MC17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,17)))
#define TSB_CAN_MC_MC18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,18)))
#define TSB_CAN_MC_MC19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,19)))
#define TSB_CAN_MC_MC20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,20)))
#define TSB_CAN_MC_MC21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,21)))
#define TSB_CAN_MC_MC22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,22)))
#define TSB_CAN_MC_MC23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,23)))
#define TSB_CAN_MC_MC24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,24)))
#define TSB_CAN_MC_MC25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,25)))
#define TSB_CAN_MC_MC26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,26)))
#define TSB_CAN_MC_MC27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,27)))
#define TSB_CAN_MC_MC28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,28)))
#define TSB_CAN_MC_MC29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,29)))
#define TSB_CAN_MC_MC30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,30)))
#define TSB_CAN_MC_MC31                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,31)))
#define TSB_CAN_MD_MD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,0)))
#define TSB_CAN_MD_MD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,1)))
#define TSB_CAN_MD_MD2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,2)))
#define TSB_CAN_MD_MD3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,3)))
#define TSB_CAN_MD_MD4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,4)))
#define TSB_CAN_MD_MD5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,5)))
#define TSB_CAN_MD_MD6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,6)))
#define TSB_CAN_MD_MD7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,7)))
#define TSB_CAN_MD_MD8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,8)))
#define TSB_CAN_MD_MD9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,9)))
#define TSB_CAN_MD_MD10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,10)))
#define TSB_CAN_MD_MD11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,11)))
#define TSB_CAN_MD_MD12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,12)))
#define TSB_CAN_MD_MD13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,13)))
#define TSB_CAN_MD_MD14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,14)))
#define TSB_CAN_MD_MD15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,15)))
#define TSB_CAN_MD_MD16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,16)))
#define TSB_CAN_MD_MD17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,17)))
#define TSB_CAN_MD_MD18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,18)))
#define TSB_CAN_MD_MD19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,19)))
#define TSB_CAN_MD_MD20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,20)))
#define TSB_CAN_MD_MD21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,21)))
#define TSB_CAN_MD_MD22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,22)))
#define TSB_CAN_MD_MD23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,23)))
#define TSB_CAN_MD_MD24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,24)))
#define TSB_CAN_MD_MD25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,25)))
#define TSB_CAN_MD_MD26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,26)))
#define TSB_CAN_MD_MD27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,27)))
#define TSB_CAN_MD_MD28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,28)))
#define TSB_CAN_MD_MD29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,29)))
#define TSB_CAN_MD_MD30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,30)))
#define TSB_CAN_MD_MD31                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,31)))
#define TSB_CAN_TRS_TRS0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,0)))
#define TSB_CAN_TRS_TRS1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,1)))
#define TSB_CAN_TRS_TRS2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,2)))
#define TSB_CAN_TRS_TRS3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,3)))
#define TSB_CAN_TRS_TRS4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,4)))
#define TSB_CAN_TRS_TRS5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,5)))
#define TSB_CAN_TRS_TRS6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,6)))
#define TSB_CAN_TRS_TRS7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,7)))
#define TSB_CAN_TRS_TRS8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,8)))
#define TSB_CAN_TRS_TRS9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,9)))
#define TSB_CAN_TRS_TRS10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,10)))
#define TSB_CAN_TRS_TRS11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,11)))
#define TSB_CAN_TRS_TRS12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,12)))
#define TSB_CAN_TRS_TRS13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,13)))
#define TSB_CAN_TRS_TRS14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,14)))
#define TSB_CAN_TRS_TRS15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,15)))
#define TSB_CAN_TRS_TRS16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,16)))
#define TSB_CAN_TRS_TRS17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,17)))
#define TSB_CAN_TRS_TRS18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,18)))
#define TSB_CAN_TRS_TRS19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,19)))
#define TSB_CAN_TRS_TRS20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,20)))
#define TSB_CAN_TRS_TRS21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,21)))
#define TSB_CAN_TRS_TRS22                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,22)))
#define TSB_CAN_TRS_TRS23                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,23)))
#define TSB_CAN_TRS_TRS24                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,24)))
#define TSB_CAN_TRS_TRS25                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,25)))
#define TSB_CAN_TRS_TRS26                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,26)))
#define TSB_CAN_TRS_TRS27                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,27)))
#define TSB_CAN_TRS_TRS28                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,28)))
#define TSB_CAN_TRS_TRS29                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,29)))
#define TSB_CAN_TRS_TRS30                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRS  ,30)))
#define TSB_CAN_TRR_TRR0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,0)))
#define TSB_CAN_TRR_TRR1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,1)))
#define TSB_CAN_TRR_TRR2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,2)))
#define TSB_CAN_TRR_TRR3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,3)))
#define TSB_CAN_TRR_TRR4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,4)))
#define TSB_CAN_TRR_TRR5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,5)))
#define TSB_CAN_TRR_TRR6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,6)))
#define TSB_CAN_TRR_TRR7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,7)))
#define TSB_CAN_TRR_TRR8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,8)))
#define TSB_CAN_TRR_TRR9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,9)))
#define TSB_CAN_TRR_TRR10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,10)))
#define TSB_CAN_TRR_TRR11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,11)))
#define TSB_CAN_TRR_TRR12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,12)))
#define TSB_CAN_TRR_TRR13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,13)))
#define TSB_CAN_TRR_TRR14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,14)))
#define TSB_CAN_TRR_TRR15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,15)))
#define TSB_CAN_TRR_TRR16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,16)))
#define TSB_CAN_TRR_TRR17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,17)))
#define TSB_CAN_TRR_TRR18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,18)))
#define TSB_CAN_TRR_TRR19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,19)))
#define TSB_CAN_TRR_TRR20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,20)))
#define TSB_CAN_TRR_TRR21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,21)))
#define TSB_CAN_TRR_TRR22                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,22)))
#define TSB_CAN_TRR_TRR23                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,23)))
#define TSB_CAN_TRR_TRR24                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,24)))
#define TSB_CAN_TRR_TRR25                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,25)))
#define TSB_CAN_TRR_TRR26                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,26)))
#define TSB_CAN_TRR_TRR27                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,27)))
#define TSB_CAN_TRR_TRR28                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,28)))
#define TSB_CAN_TRR_TRR29                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,29)))
#define TSB_CAN_TRR_TRR30                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TRR  ,30)))
#define TSB_CAN_TA_TA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,0)))
#define TSB_CAN_TA_TA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,1)))
#define TSB_CAN_TA_TA2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,2)))
#define TSB_CAN_TA_TA3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,3)))
#define TSB_CAN_TA_TA4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,4)))
#define TSB_CAN_TA_TA5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,5)))
#define TSB_CAN_TA_TA6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,6)))
#define TSB_CAN_TA_TA7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,7)))
#define TSB_CAN_TA_TA8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,8)))
#define TSB_CAN_TA_TA9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,9)))
#define TSB_CAN_TA_TA10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,10)))
#define TSB_CAN_TA_TA11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,11)))
#define TSB_CAN_TA_TA12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,12)))
#define TSB_CAN_TA_TA13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,13)))
#define TSB_CAN_TA_TA14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,14)))
#define TSB_CAN_TA_TA15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,15)))
#define TSB_CAN_TA_TA16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,16)))
#define TSB_CAN_TA_TA17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,17)))
#define TSB_CAN_TA_TA18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,18)))
#define TSB_CAN_TA_TA19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,19)))
#define TSB_CAN_TA_TA20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,20)))
#define TSB_CAN_TA_TA21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,21)))
#define TSB_CAN_TA_TA22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,22)))
#define TSB_CAN_TA_TA23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,23)))
#define TSB_CAN_TA_TA24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,24)))
#define TSB_CAN_TA_TA25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,25)))
#define TSB_CAN_TA_TA26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,26)))
#define TSB_CAN_TA_TA27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,27)))
#define TSB_CAN_TA_TA28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,28)))
#define TSB_CAN_TA_TA29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,29)))
#define TSB_CAN_TA_TA30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->TA   ,30)))
#define TSB_CAN_AA_AA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,0)))
#define TSB_CAN_AA_AA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,1)))
#define TSB_CAN_AA_AA2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,2)))
#define TSB_CAN_AA_AA3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,3)))
#define TSB_CAN_AA_AA4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,4)))
#define TSB_CAN_AA_AA5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,5)))
#define TSB_CAN_AA_AA6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,6)))
#define TSB_CAN_AA_AA7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,7)))
#define TSB_CAN_AA_AA8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,8)))
#define TSB_CAN_AA_AA9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,9)))
#define TSB_CAN_AA_AA10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,10)))
#define TSB_CAN_AA_AA11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,11)))
#define TSB_CAN_AA_AA12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,12)))
#define TSB_CAN_AA_AA13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,13)))
#define TSB_CAN_AA_AA14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,14)))
#define TSB_CAN_AA_AA15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,15)))
#define TSB_CAN_AA_AA16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,16)))
#define TSB_CAN_AA_AA17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,17)))
#define TSB_CAN_AA_AA18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,18)))
#define TSB_CAN_AA_AA19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,19)))
#define TSB_CAN_AA_AA20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,20)))
#define TSB_CAN_AA_AA21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,21)))
#define TSB_CAN_AA_AA22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,22)))
#define TSB_CAN_AA_AA23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,23)))
#define TSB_CAN_AA_AA24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,24)))
#define TSB_CAN_AA_AA25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,25)))
#define TSB_CAN_AA_AA26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,26)))
#define TSB_CAN_AA_AA27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,27)))
#define TSB_CAN_AA_AA28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,28)))
#define TSB_CAN_AA_AA29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,29)))
#define TSB_CAN_AA_AA30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA   ,30)))
#define TSB_CAN_RMP_RMP0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,0)))
#define TSB_CAN_RMP_RMP1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,1)))
#define TSB_CAN_RMP_RMP2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,2)))
#define TSB_CAN_RMP_RMP3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,3)))
#define TSB_CAN_RMP_RMP4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,4)))
#define TSB_CAN_RMP_RMP5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,5)))
#define TSB_CAN_RMP_RMP6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,6)))
#define TSB_CAN_RMP_RMP7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,7)))
#define TSB_CAN_RMP_RMP8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,8)))
#define TSB_CAN_RMP_RMP9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,9)))
#define TSB_CAN_RMP_RMP10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,10)))
#define TSB_CAN_RMP_RMP11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,11)))
#define TSB_CAN_RMP_RMP12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,12)))
#define TSB_CAN_RMP_RMP13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,13)))
#define TSB_CAN_RMP_RMP14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,14)))
#define TSB_CAN_RMP_RMP15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,15)))
#define TSB_CAN_RMP_RMP16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,16)))
#define TSB_CAN_RMP_RMP17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,17)))
#define TSB_CAN_RMP_RMP18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,18)))
#define TSB_CAN_RMP_RMP19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,19)))
#define TSB_CAN_RMP_RMP20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,20)))
#define TSB_CAN_RMP_RMP21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,21)))
#define TSB_CAN_RMP_RMP22                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,22)))
#define TSB_CAN_RMP_RMP23                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,23)))
#define TSB_CAN_RMP_RMP24                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,24)))
#define TSB_CAN_RMP_RMP25                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,25)))
#define TSB_CAN_RMP_RMP26                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,26)))
#define TSB_CAN_RMP_RMP27                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,27)))
#define TSB_CAN_RMP_RMP28                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,28)))
#define TSB_CAN_RMP_RMP29                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,29)))
#define TSB_CAN_RMP_RMP30                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,30)))
#define TSB_CAN_RMP_RMP31                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP  ,31)))
#define TSB_CAN_RML_RML0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,0)))
#define TSB_CAN_RML_RML1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,1)))
#define TSB_CAN_RML_RML2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,2)))
#define TSB_CAN_RML_RML3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,3)))
#define TSB_CAN_RML_RML4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,4)))
#define TSB_CAN_RML_RML5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,5)))
#define TSB_CAN_RML_RML6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,6)))
#define TSB_CAN_RML_RML7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,7)))
#define TSB_CAN_RML_RML8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,8)))
#define TSB_CAN_RML_RML9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,9)))
#define TSB_CAN_RML_RML10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,10)))
#define TSB_CAN_RML_RML11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,11)))
#define TSB_CAN_RML_RML12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,12)))
#define TSB_CAN_RML_RML13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,13)))
#define TSB_CAN_RML_RML14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,14)))
#define TSB_CAN_RML_RML15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,15)))
#define TSB_CAN_RML_RML16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,16)))
#define TSB_CAN_RML_RML17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,17)))
#define TSB_CAN_RML_RML18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,18)))
#define TSB_CAN_RML_RML19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,19)))
#define TSB_CAN_RML_RML20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,20)))
#define TSB_CAN_RML_RML21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML  ,21)))
