MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* USB Host Controller */
#define TSB_HC_CONTROL_PLE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,2)))
#define TSB_HC_CONTROL_IE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,3)))
#define TSB_HC_CONTROL_CLE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,4)))
#define TSB_HC_CONTROL_BLE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,5)))
#define TSB_HC_CONTROL_IR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,8)))
#define TSB_HC_CONTROL_RWC                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,9)))
#define TSB_HC_CONTROL_RWE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->CONTROL         ,10)))
#define TSB_HC_COMMANDSTATUS_HCR            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->COMMANDSTATUS   ,0)))
#define TSB_HC_COMMANDSTATUS_CLF            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->COMMANDSTATUS   ,1)))
#define TSB_HC_COMMANDSTATUS_BLF            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->COMMANDSTATUS   ,2)))
#define TSB_HC_COMMANDSTATUS_OCR            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->COMMANDSTATUS   ,3)))
#define TSB_HC_INTERRUPTSTATUS_SO           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,0)))
#define TSB_HC_INTERRUPTSTATUS_WDH          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,1)))
#define TSB_HC_INTERRUPTSTATUS_SF           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,2)))
#define TSB_HC_INTERRUPTSTATUS_RD           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,3)))
#define TSB_HC_INTERRUPTSTATUS_UE           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,4)))
#define TSB_HC_INTERRUPTSTATUS_FNO          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,5)))
#define TSB_HC_INTERRUPTSTATUS_RHSC         (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,6)))
#define TSB_HC_INTERRUPTSTATUS_OC           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTSTATUS ,30)))
#define TSB_HC_INTERRUPTENABLE_SO           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,0)))
#define TSB_HC_INTERRUPTENABLE_WDH          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,1)))
#define TSB_HC_INTERRUPTENABLE_SF           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,2)))
#define TSB_HC_INTERRUPTENABLE_RD           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,3)))
#define TSB_HC_INTERRUPTENABLE_UE           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,4)))
#define TSB_HC_INTERRUPTENABLE_FNO          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,5)))
#define TSB_HC_INTERRUPTENABLE_RHSC         (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,6)))
#define TSB_HC_INTERRUPTENABLE_OC           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,30)))
#define TSB_HC_INTERRUPTENABLE_MIE          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTENABLE ,31)))
#define TSB_HC_INTERRUPTDISABLE_SO          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,0)))
#define TSB_HC_INTERRUPTDISABLE_WDH         (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,1)))
#define TSB_HC_INTERRUPTDISABLE_SF          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,2)))
#define TSB_HC_INTERRUPTDISABLE_RD          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,3)))
#define TSB_HC_INTERRUPTDISABLE_UE          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,4)))
#define TSB_HC_INTERRUPTDISABLE_FNO         (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,5)))
#define TSB_HC_INTERRUPTDISABLE_RHSC        (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,6)))
#define TSB_HC_INTERRUPTDISABLE_OC          (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,30)))
#define TSB_HC_INTERRUPTDISABLE_MIE         (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->INTERRUPTDISABLE,31)))
#define TSB_HC_FMINTERVAL_FIT               (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->FMINTERVAL      ,31)))
#define TSB_HC_FMREMAINING_FRT              (*((__I  uint32_t *)BITBAND_PERI(&TSB_HC->FMREMAINING     ,31)))
#define TSB_HC_RHDESCRIPTORA_PSM            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHDESCRIPTORA   ,8)))
#define TSB_HC_RHDESCRIPTORA_NPS            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHDESCRIPTORA   ,9)))
#define TSB_HC_RHDESCRIPTORA_DT             (*((__I  uint32_t *)BITBAND_PERI(&TSB_HC->RHDESCRIPTORA   ,10)))
#define TSB_HC_RHDESCRIPTORA_OCPM           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHDESCRIPTORA   ,11)))
#define TSB_HC_RHDESCRIPTORA_NOCP           (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHDESCRIPTORA   ,12)))
#define TSB_HC_RHSTATUS_LPS                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,0)))
#define TSB_HC_RHSTATUS_OCI                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,1)))
#define TSB_HC_RHSTATUS_DRWE                (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,15)))
#define TSB_HC_RHSTATUS_LPSC                (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,16)))
#define TSB_HC_RHSTATUS_OCIC                (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,17)))
#define TSB_HC_RHSTATUS_CRWE                (*((__O  uint32_t *)BITBAND_PERI(&TSB_HC->RHSTATUS        ,31)))
#define TSB_HC_RHPORTSTATUS_CCS             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,0)))
#define TSB_HC_RHPORTSTATUS_PES             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,1)))
#define TSB_HC_RHPORTSTATUS_PSS             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,2)))
#define TSB_HC_RHPORTSTATUS_POCI            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,3)))
#define TSB_HC_RHPORTSTATUS_PRS             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,4)))
#define TSB_HC_RHPORTSTATUS_PPS             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,8)))
#define TSB_HC_RHPORTSTATUS_LSDA            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,9)))
#define TSB_HC_RHPORTSTATUS_CSC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,16)))
#define TSB_HC_RHPORTSTATUS_PESC            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,17)))
#define TSB_HC_RHPORTSTATUS_PSSC            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,18)))
#define TSB_HC_RHPORTSTATUS_OCIC            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,19)))
#define TSB_HC_RHPORTSTATUS_PRSC            (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->RHPORTSTATUS    ,20)))
#define TSB_HC_BCR0_OVEC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->BCR0            ,29)))
#define TSB_HC_BCR0_TRNS_SUSP               (*((__IO uint32_t *)BITBAND_PERI(&TSB_HC->BCR0            ,30)))

/* General Purpose Input/Output Port (PA) */
#define TSB_PA_DATA_PA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,0)))
#define TSB_PA_DATA_PA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,1)))
#define TSB_PA_DATA_PA2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,2)))
#define TSB_PA_DATA_PA3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,3)))
#define TSB_PA_DATA_PA4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,4)))
#define TSB_PA_DATA_PA5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,5)))
#define TSB_PA_DATA_PA6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,6)))
#define TSB_PA_DATA_PA7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->DATA,7)))
#define TSB_PA_CR_PA0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,0)))
#define TSB_PA_CR_PA1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,1)))
#define TSB_PA_CR_PA2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,2)))
#define TSB_PA_CR_PA3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,3)))
#define TSB_PA_CR_PA4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,4)))
#define TSB_PA_CR_PA5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,5)))
#define TSB_PA_CR_PA6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,6)))
#define TSB_PA_CR_PA7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->CR  ,7)))
#define TSB_PA_FR1_PA0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,0)))
#define TSB_PA_FR1_PA1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,1)))
#define TSB_PA_FR1_PA2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,2)))
#define TSB_PA_FR1_PA3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,3)))
#define TSB_PA_FR1_PA4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,4)))
#define TSB_PA_FR1_PA5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,5)))
#define TSB_PA_FR1_PA6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,6)))
#define TSB_PA_FR1_PA7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->FR1 ,7)))
#define TSB_PA_OD_PA0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,0)))
#define TSB_PA_OD_PA1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,1)))
#define TSB_PA_OD_PA2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,2)))
#define TSB_PA_OD_PA3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,3)))
#define TSB_PA_OD_PA4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,4)))
#define TSB_PA_OD_PA5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,5)))
#define TSB_PA_OD_PA6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,6)))
#define TSB_PA_OD_PA7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->OD  ,7)))
#define TSB_PA_PUP_PA0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,0)))
#define TSB_PA_PUP_PA1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,1)))
#define TSB_PA_PUP_PA2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,2)))
#define TSB_PA_PUP_PA3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,3)))
#define TSB_PA_PUP_PA4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,4)))
#define TSB_PA_PUP_PA5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,5)))
#define TSB_PA_PUP_PA6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,6)))
#define TSB_PA_PUP_PA7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->PUP ,7)))
#define TSB_PA_IE_PA0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,0)))
#define TSB_PA_IE_PA1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,1)))
#define TSB_PA_IE_PA2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,2)))
#define TSB_PA_IE_PA3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,3)))
#define TSB_PA_IE_PA4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,4)))
#define TSB_PA_IE_PA5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,5)))
#define TSB_PA_IE_PA6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,6)))
#define TSB_PA_IE_PA7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PA->IE  ,7)))

/* General Purpose Input/Output Port (PB) */
#define TSB_PB_DATA_PB0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,0)))
#define TSB_PB_DATA_PB1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,1)))
#define TSB_PB_DATA_PB2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,2)))
#define TSB_PB_DATA_PB3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,3)))
#define TSB_PB_DATA_PB4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,4)))
#define TSB_PB_DATA_PB5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,5)))
#define TSB_PB_DATA_PB6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,6)))
#define TSB_PB_DATA_PB7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->DATA,7)))
#define TSB_PB_CR_PB0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,0)))
#define TSB_PB_CR_PB1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,1)))
#define TSB_PB_CR_PB2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,2)))
#define TSB_PB_CR_PB3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,3)))
#define TSB_PB_CR_PB4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,4)))
#define TSB_PB_CR_PB5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,5)))
#define TSB_PB_CR_PB6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,6)))
#define TSB_PB_CR_PB7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->CR  ,7)))
#define TSB_PB_FR1_PB0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,0)))
#define TSB_PB_FR1_PB1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,1)))
#define TSB_PB_FR1_PB2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,2)))
#define TSB_PB_FR1_PB3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,3)))
#define TSB_PB_FR1_PB4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,4)))
#define TSB_PB_FR1_PB5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,5)))
#define TSB_PB_FR1_PB6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,6)))
#define TSB_PB_FR1_PB7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->FR1 ,7)))
#define TSB_PB_OD_PB0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,0)))
#define TSB_PB_OD_PB1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,1)))
#define TSB_PB_OD_PB2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,2)))
#define TSB_PB_OD_PB3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,3)))
#define TSB_PB_OD_PB4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,4)))
#define TSB_PB_OD_PB5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,5)))
#define TSB_PB_OD_PB6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,6)))
#define TSB_PB_OD_PB7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->OD  ,7)))
#define TSB_PB_PUP_PB0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,0)))
#define TSB_PB_PUP_PB1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,1)))
#define TSB_PB_PUP_PB2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,2)))
#define TSB_PB_PUP_PB3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,3)))
#define TSB_PB_PUP_PB4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,4)))
#define TSB_PB_PUP_PB5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,5)))
#define TSB_PB_PUP_PB6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,6)))
#define TSB_PB_PUP_PB7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->PUP ,7)))
#define TSB_PB_IE_PB0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,0)))
#define TSB_PB_IE_PB1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,1)))
#define TSB_PB_IE_PB2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,2)))
#define TSB_PB_IE_PB3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,3)))
#define TSB_PB_IE_PB4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,4)))
#define TSB_PB_IE_PB5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,5)))
#define TSB_PB_IE_PB6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,6)))
#define TSB_PB_IE_PB7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PB->IE  ,7)))

/* General Purpose Input/Output Port (PC) */
#define TSB_PC_DATA_PC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,0)))
#define TSB_PC_DATA_PC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,1)))
#define TSB_PC_DATA_PC2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,2)))
#define TSB_PC_DATA_PC3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,3)))
#define TSB_PC_DATA_PC4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,4)))
#define TSB_PC_DATA_PC5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,5)))
#define TSB_PC_DATA_PC6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,6)))
#define TSB_PC_DATA_PC7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->DATA,7)))
#define TSB_PC_CR_PC0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,0)))
#define TSB_PC_CR_PC1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,1)))
#define TSB_PC_CR_PC2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,2)))
#define TSB_PC_CR_PC3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,3)))
#define TSB_PC_CR_PC4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,4)))
#define TSB_PC_CR_PC5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,5)))
#define TSB_PC_CR_PC6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,6)))
#define TSB_PC_CR_PC7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->CR  ,7)))
#define TSB_PC_FR1_PC0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,0)))
#define TSB_PC_FR1_PC1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,1)))
#define TSB_PC_FR1_PC2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,2)))
#define TSB_PC_FR1_PC3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,3)))
#define TSB_PC_FR1_PC4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,4)))
#define TSB_PC_FR1_PC5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,5)))
#define TSB_PC_FR1_PC6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,6)))
#define TSB_PC_FR1_PC7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR1 ,7)))
#define TSB_PC_FR2_PC0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,0)))
#define TSB_PC_FR2_PC1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,1)))
#define TSB_PC_FR2_PC2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,2)))
#define TSB_PC_FR2_PC4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,4)))
#define TSB_PC_FR2_PC5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,5)))
#define TSB_PC_FR2_PC6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR2 ,6)))
#define TSB_PC_FR3_PC2F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR3 ,2)))
#define TSB_PC_FR3_PC6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->FR3 ,6)))
#define TSB_PC_OD_PC0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,0)))
#define TSB_PC_OD_PC1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,1)))
#define TSB_PC_OD_PC2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,2)))
#define TSB_PC_OD_PC3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,3)))
#define TSB_PC_OD_PC4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,4)))
#define TSB_PC_OD_PC5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,5)))
#define TSB_PC_OD_PC6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,6)))
#define TSB_PC_OD_PC7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->OD  ,7)))
#define TSB_PC_PUP_PC0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,0)))
#define TSB_PC_PUP_PC1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,1)))
#define TSB_PC_PUP_PC2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,2)))
#define TSB_PC_PUP_PC3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,3)))
#define TSB_PC_PUP_PC4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,4)))
#define TSB_PC_PUP_PC5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,5)))
#define TSB_PC_PUP_PC6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,6)))
#define TSB_PC_PUP_PC7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->PUP ,7)))
#define TSB_PC_IE_PC0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,0)))
#define TSB_PC_IE_PC1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,1)))
#define TSB_PC_IE_PC2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,2)))
#define TSB_PC_IE_PC3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,3)))
#define TSB_PC_IE_PC4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,4)))
#define TSB_PC_IE_PC5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,5)))
#define TSB_PC_IE_PC6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,6)))
#define TSB_PC_IE_PC7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PC->IE  ,7)))

