MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* General Purpose Input/Output Port (PD) */
#define TSB_PD_DATA_PD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,0)))
#define TSB_PD_DATA_PD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,1)))
#define TSB_PD_DATA_PD2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,2)))
#define TSB_PD_DATA_PD3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,3)))
#define TSB_PD_DATA_PD4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,4)))
#define TSB_PD_DATA_PD5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,5)))
#define TSB_PD_DATA_PD6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,6)))
#define TSB_PD_DATA_PD7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->DATA,7)))
#define TSB_PD_CR_PD0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,0)))
#define TSB_PD_CR_PD1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,1)))
#define TSB_PD_CR_PD2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,2)))
#define TSB_PD_CR_PD3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,3)))
#define TSB_PD_CR_PD4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,4)))
#define TSB_PD_CR_PD5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,5)))
#define TSB_PD_CR_PD6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,6)))
#define TSB_PD_CR_PD7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->CR  ,7)))
#define TSB_PD_FR1_PD0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,0)))
#define TSB_PD_FR1_PD1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,1)))
#define TSB_PD_FR1_PD2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,2)))
#define TSB_PD_FR1_PD3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,3)))
#define TSB_PD_FR1_PD4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,4)))
#define TSB_PD_FR1_PD5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,5)))
#define TSB_PD_FR1_PD6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,6)))
#define TSB_PD_FR1_PD7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR1 ,7)))
#define TSB_PD_FR2_PD0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,0)))
#define TSB_PD_FR2_PD1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,1)))
#define TSB_PD_FR2_PD2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,2)))
#define TSB_PD_FR2_PD4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,4)))
#define TSB_PD_FR2_PD5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,5)))
#define TSB_PD_FR2_PD6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,6)))
#define TSB_PD_FR2_PD7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR2 ,7)))
#define TSB_PD_FR3_PD2F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR3 ,2)))
#define TSB_PD_FR3_PD6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->FR3 ,6)))
#define TSB_PD_OD_PD0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,0)))
#define TSB_PD_OD_PD1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,1)))
#define TSB_PD_OD_PD2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,2)))
#define TSB_PD_OD_PD3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,3)))
#define TSB_PD_OD_PD4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,4)))
#define TSB_PD_OD_PD5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,5)))
#define TSB_PD_OD_PD6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,6)))
#define TSB_PD_OD_PD7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->OD  ,7)))
#define TSB_PD_PUP_PD0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,0)))
#define TSB_PD_PUP_PD1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,1)))
#define TSB_PD_PUP_PD2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,2)))
#define TSB_PD_PUP_PD3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,3)))
#define TSB_PD_PUP_PD4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,4)))
#define TSB_PD_PUP_PD5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,5)))
#define TSB_PD_PUP_PD6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,6)))
#define TSB_PD_PUP_PD7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->PUP ,7)))
#define TSB_PD_IE_PD0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,0)))
#define TSB_PD_IE_PD1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,1)))
#define TSB_PD_IE_PD2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,2)))
#define TSB_PD_IE_PD3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,3)))
#define TSB_PD_IE_PD4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,4)))
#define TSB_PD_IE_PD5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,5)))
#define TSB_PD_IE_PD6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,6)))
#define TSB_PD_IE_PD7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PD->IE  ,7)))

/* General Purpose Input/Output Port (PE) */
#define TSB_PE_DATA_PE0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,0)))
#define TSB_PE_DATA_PE1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,1)))
#define TSB_PE_DATA_PE2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,2)))
#define TSB_PE_DATA_PE3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,3)))
#define TSB_PE_DATA_PE4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,4)))
#define TSB_PE_DATA_PE5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,5)))
#define TSB_PE_DATA_PE6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,6)))
#define TSB_PE_DATA_PE7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->DATA,7)))
#define TSB_PE_CR_PE0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,0)))
#define TSB_PE_CR_PE1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,1)))
#define TSB_PE_CR_PE2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,2)))
#define TSB_PE_CR_PE3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,3)))
#define TSB_PE_CR_PE4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,4)))
#define TSB_PE_CR_PE5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,5)))
#define TSB_PE_CR_PE6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,6)))
#define TSB_PE_CR_PE7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->CR  ,7)))
#define TSB_PE_FR1_PE0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,0)))
#define TSB_PE_FR1_PE1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,1)))
#define TSB_PE_FR1_PE2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,2)))
#define TSB_PE_FR1_PE3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,3)))
#define TSB_PE_FR1_PE4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,4)))
#define TSB_PE_FR1_PE5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,5)))
#define TSB_PE_FR1_PE6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR1 ,6)))
#define TSB_PE_FR2_PE0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,0)))
#define TSB_PE_FR2_PE1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,1)))
#define TSB_PE_FR2_PE2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,2)))
#define TSB_PE_FR2_PE3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,3)))
#define TSB_PE_FR2_PE4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,4)))
#define TSB_PE_FR2_PE5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,5)))
#define TSB_PE_FR2_PE6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,6)))
#define TSB_PE_FR2_PE7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR2 ,7)))
#define TSB_PE_FR3_PE6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR3 ,6)))
#define TSB_PE_FR3_PE7F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->FR3 ,7)))
#define TSB_PE_OD_PE0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,0)))
#define TSB_PE_OD_PE1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,1)))
#define TSB_PE_OD_PE2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,2)))
#define TSB_PE_OD_PE3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,3)))
#define TSB_PE_OD_PE4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,4)))
#define TSB_PE_OD_PE5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,5)))
#define TSB_PE_OD_PE6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,6)))
#define TSB_PE_OD_PE7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->OD  ,7)))
#define TSB_PE_PUP_PE0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,0)))
#define TSB_PE_PUP_PE1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,1)))
#define TSB_PE_PUP_PE2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,2)))
#define TSB_PE_PUP_PE3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,3)))
#define TSB_PE_PUP_PE4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,4)))
#define TSB_PE_PUP_PE5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,5)))
#define TSB_PE_PUP_PE6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,6)))
#define TSB_PE_PUP_PE7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->PUP ,7)))
#define TSB_PE_IE_PE0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,0)))
#define TSB_PE_IE_PE1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,1)))
#define TSB_PE_IE_PE2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,2)))
#define TSB_PE_IE_PE3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,3)))
#define TSB_PE_IE_PE4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,4)))
#define TSB_PE_IE_PE5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,5)))
#define TSB_PE_IE_PE6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,6)))
#define TSB_PE_IE_PE7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PE->IE  ,7)))

/* General Purpose Input/Output Port (PF) */
#define TSB_PF_DATA_PF0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->DATA,0)))
#define TSB_PF_DATA_PF1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->DATA,1)))
#define TSB_PF_DATA_PF2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->DATA,2)))
#define TSB_PF_DATA_PF3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->DATA,3)))
#define TSB_PF_DATA_PF4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->DATA,4)))
#define TSB_PF_CR_PF0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->CR  ,0)))
#define TSB_PF_CR_PF1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->CR  ,1)))
#define TSB_PF_CR_PF2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->CR  ,2)))
#define TSB_PF_CR_PF3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->CR  ,3)))
#define TSB_PF_CR_PF4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->CR  ,4)))
#define TSB_PF_FR1_PF0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->FR1 ,0)))
#define TSB_PF_FR1_PF1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->FR1 ,1)))
#define TSB_PF_FR1_PF2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->FR1 ,2)))
#define TSB_PF_FR1_PF3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->FR1 ,3)))
#define TSB_PF_FR1_PF4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->FR1 ,4)))
#define TSB_PF_OD_PF0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->OD  ,0)))
#define TSB_PF_OD_PF1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->OD  ,1)))
#define TSB_PF_OD_PF2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->OD  ,2)))
#define TSB_PF_OD_PF3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->OD  ,3)))
#define TSB_PF_OD_PF4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->OD  ,4)))
#define TSB_PF_PUP_PF0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->PUP ,0)))
#define TSB_PF_PUP_PF1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->PUP ,1)))
#define TSB_PF_PUP_PF2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->PUP ,2)))
#define TSB_PF_PUP_PF3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->PUP ,3)))
#define TSB_PF_PUP_PF4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->PUP ,4)))
#define TSB_PF_IE_PF0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->IE  ,0)))
#define TSB_PF_IE_PF1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->IE  ,1)))
#define TSB_PF_IE_PF2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->IE  ,2)))
#define TSB_PF_IE_PF3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->IE  ,3)))
#define TSB_PF_IE_PF4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PF->IE  ,4)))

/* General Purpose Input/Output Port (PG) */
#define TSB_PG_DATA_PG0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,0)))
#define TSB_PG_DATA_PG1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,1)))
#define TSB_PG_DATA_PG2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,2)))
#define TSB_PG_DATA_PG3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,3)))
#define TSB_PG_DATA_PG4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,4)))
#define TSB_PG_DATA_PG5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,5)))
#define TSB_PG_DATA_PG6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,6)))
#define TSB_PG_DATA_PG7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->DATA,7)))
#define TSB_PG_CR_PG0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,0)))
#define TSB_PG_CR_PG1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,1)))
#define TSB_PG_CR_PG2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,2)))
#define TSB_PG_CR_PG3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,3)))
#define TSB_PG_CR_PG4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,4)))
#define TSB_PG_CR_PG5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,5)))
#define TSB_PG_CR_PG6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,6)))
#define TSB_PG_CR_PG7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->CR  ,7)))
#define TSB_PG_FR1_PG0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,0)))
#define TSB_PG_FR1_PG1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,1)))
#define TSB_PG_FR1_PG2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,2)))
#define TSB_PG_FR1_PG3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,3)))
#define TSB_PG_FR1_PG4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,4)))
#define TSB_PG_FR1_PG5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,5)))
#define TSB_PG_FR1_PG6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,6)))
#define TSB_PG_FR1_PG7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR1 ,7)))
#define TSB_PG_FR2_PG0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR2 ,0)))
#define TSB_PG_FR2_PG1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR2 ,1)))
#define TSB_PG_FR2_PG4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR2 ,4)))
#define TSB_PG_FR2_PG5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR2 ,5)))
#define TSB_PG_FR3_PG2F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR3 ,2)))
#define TSB_PG_FR3_PG3F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR3 ,3)))
#define TSB_PG_FR3_PG6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR3 ,6)))
#define TSB_PG_FR3_PG7F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->FR3 ,7)))
#define TSB_PG_OD_PG0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,0)))
#define TSB_PG_OD_PG1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,1)))
#define TSB_PG_OD_PG2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,2)))
#define TSB_PG_OD_PG3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,3)))
#define TSB_PG_OD_PG4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,4)))
#define TSB_PG_OD_PG5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,5)))
#define TSB_PG_OD_PG6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,6)))
#define TSB_PG_OD_PG7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->OD  ,7)))
#define TSB_PG_PUP_PG0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,0)))
#define TSB_PG_PUP_PG1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,1)))
#define TSB_PG_PUP_PG2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,2)))
#define TSB_PG_PUP_PG3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,3)))
#define TSB_PG_PUP_PG4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,4)))
#define TSB_PG_PUP_PG5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,5)))
#define TSB_PG_PUP_PG6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,6)))
#define TSB_PG_PUP_PG7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->PUP ,7)))
#define TSB_PG_IE_PG0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,0)))
#define TSB_PG_IE_PG1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,1)))
#define TSB_PG_IE_PG2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,2)))
#define TSB_PG_IE_PG3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,3)))
#define TSB_PG_IE_PG4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,4)))
#define TSB_PG_IE_PG5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,5)))
#define TSB_PG_IE_PG6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,6)))
#define TSB_PG_IE_PG7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PG->IE  ,7)))

