MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* General Purpose Input/Output Port (PJ) */
#define TSB_PJ_DATA_PJ0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,0)))
#define TSB_PJ_DATA_PJ1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,1)))
#define TSB_PJ_DATA_PJ2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,2)))
#define TSB_PJ_DATA_PJ3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,3)))
#define TSB_PJ_DATA_PJ4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,4)))
#define TSB_PJ_DATA_PJ5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,5)))
#define TSB_PJ_DATA_PJ6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,6)))
#define TSB_PJ_DATA_PJ7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->DATA,7)))
#define TSB_PJ_FR2_PJ3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->FR2 ,3)))
#define TSB_PJ_FR2_PJ4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->FR2 ,4)))
#define TSB_PJ_FR2_PJ5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->FR2 ,5)))
#define TSB_PJ_FR2_PJ6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->FR2 ,6)))
#define TSB_PJ_FR2_PJ7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->FR2 ,7)))
#define TSB_PJ_PUP_PJ0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,0)))
#define TSB_PJ_PUP_PJ1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,1)))
#define TSB_PJ_PUP_PJ2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,2)))
#define TSB_PJ_PUP_PJ3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,3)))
#define TSB_PJ_PUP_PJ4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,4)))
#define TSB_PJ_PUP_PJ5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,5)))
#define TSB_PJ_PUP_PJ6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,6)))
#define TSB_PJ_PUP_PJ7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->PUP ,7)))
#define TSB_PJ_IE_PJ0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,0)))
#define TSB_PJ_IE_PJ1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,1)))
#define TSB_PJ_IE_PJ2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,2)))
#define TSB_PJ_IE_PJ3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,3)))
#define TSB_PJ_IE_PJ4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,4)))
#define TSB_PJ_IE_PJ5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,5)))
#define TSB_PJ_IE_PJ6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,6)))
#define TSB_PJ_IE_PJ7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PJ->IE  ,7)))

/* General Purpose Input/Output Port (PK) */
#define TSB_PK_DATA_PK0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,0)))
#define TSB_PK_DATA_PK1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,1)))
#define TSB_PK_DATA_PK2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,2)))
#define TSB_PK_DATA_PK3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,3)))
#define TSB_PK_DATA_PK4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,4)))
#define TSB_PK_DATA_PK5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,5)))
#define TSB_PK_DATA_PK6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,6)))
#define TSB_PK_DATA_PK7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->DATA,7)))
#define TSB_PK_PUP_PK0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,0)))
#define TSB_PK_PUP_PK1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,1)))
#define TSB_PK_PUP_PK2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,2)))
#define TSB_PK_PUP_PK3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,3)))
#define TSB_PK_PUP_PK4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,4)))
#define TSB_PK_PUP_PK5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,5)))
#define TSB_PK_PUP_PK6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,6)))
#define TSB_PK_PUP_PK7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->PUP ,7)))
#define TSB_PK_IE_PK0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,0)))
#define TSB_PK_IE_PK1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,1)))
#define TSB_PK_IE_PK2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,2)))
#define TSB_PK_IE_PK3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,3)))
#define TSB_PK_IE_PK4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,4)))
#define TSB_PK_IE_PK5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,5)))
#define TSB_PK_IE_PK6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,6)))
#define TSB_PK_IE_PK7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PK->IE  ,7)))

/* General Purpose Input/Output Port (PL) */
#define TSB_PL_DATA_PL0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,0)))
#define TSB_PL_DATA_PL1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,1)))
#define TSB_PL_DATA_PL2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,2)))
#define TSB_PL_DATA_PL3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,3)))
#define TSB_PL_DATA_PL4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,4)))
#define TSB_PL_DATA_PL5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,5)))
#define TSB_PL_DATA_PL6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,6)))
#define TSB_PL_DATA_PL7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->DATA,7)))
#define TSB_PL_CR_PL0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,0)))
#define TSB_PL_CR_PL1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,1)))
#define TSB_PL_CR_PL2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,2)))
#define TSB_PL_CR_PL3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,3)))
#define TSB_PL_CR_PL4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,4)))
#define TSB_PL_CR_PL5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,5)))
#define TSB_PL_CR_PL6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,6)))
#define TSB_PL_CR_PL7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->CR  ,7)))
#define TSB_PL_FR1_PL0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,0)))
#define TSB_PL_FR1_PL1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,1)))
#define TSB_PL_FR1_PL2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,2)))
#define TSB_PL_FR1_PL3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,3)))
#define TSB_PL_FR1_PL4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,4)))
#define TSB_PL_FR1_PL5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,5)))
#define TSB_PL_FR1_PL6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,6)))
#define TSB_PL_FR1_PL7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR1 ,7)))
#define TSB_PL_FR2_PL0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,0)))
#define TSB_PL_FR2_PL1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,1)))
#define TSB_PL_FR2_PL2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,2)))
#define TSB_PL_FR2_PL3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,3)))
#define TSB_PL_FR2_PL4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,4)))
#define TSB_PL_FR2_PL5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,5)))
#define TSB_PL_FR2_PL6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,6)))
#define TSB_PL_FR2_PL7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR2 ,7)))
#define TSB_PL_FR3_PL6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->FR3 ,6)))
#define TSB_PL_OD_PL0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,0)))
#define TSB_PL_OD_PL1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,1)))
#define TSB_PL_OD_PL2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,2)))
#define TSB_PL_OD_PL3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,3)))
#define TSB_PL_OD_PL4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,4)))
#define TSB_PL_OD_PL5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,5)))
#define TSB_PL_OD_PL6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,6)))
#define TSB_PL_OD_PL7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->OD  ,7)))
#define TSB_PL_PUP_PL0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,0)))
#define TSB_PL_PUP_PL1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,1)))
#define TSB_PL_PUP_PL2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,2)))
#define TSB_PL_PUP_PL3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,3)))
#define TSB_PL_PUP_PL4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,4)))
#define TSB_PL_PUP_PL5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,5)))
#define TSB_PL_PUP_PL6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,6)))
#define TSB_PL_PUP_PL7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->PUP ,7)))
#define TSB_PL_IE_PL0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,0)))
#define TSB_PL_IE_PL1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,1)))
#define TSB_PL_IE_PL2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,2)))
#define TSB_PL_IE_PL3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,3)))
#define TSB_PL_IE_PL4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,4)))
#define TSB_PL_IE_PL5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,5)))
#define TSB_PL_IE_PL6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,6)))
#define TSB_PL_IE_PL7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PL->IE  ,7)))

