MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* General Purpose Input/Output Port (PM) */
#define TSB_PM_DATA_PM0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,0)))
#define TSB_PM_DATA_PM1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,1)))
#define TSB_PM_DATA_PM2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,2)))
#define TSB_PM_DATA_PM3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,3)))
#define TSB_PM_DATA_PM4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,4)))
#define TSB_PM_DATA_PM5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,5)))
#define TSB_PM_DATA_PM6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,6)))
#define TSB_PM_DATA_PM7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->DATA,7)))
#define TSB_PM_CR_PM0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,0)))
#define TSB_PM_CR_PM1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,1)))
#define TSB_PM_CR_PM2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,2)))
#define TSB_PM_CR_PM3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,3)))
#define TSB_PM_CR_PM4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,4)))
#define TSB_PM_CR_PM5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,5)))
#define TSB_PM_CR_PM6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,6)))
#define TSB_PM_CR_PM7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->CR  ,7)))
#define TSB_PM_FR1_PM0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,0)))
#define TSB_PM_FR1_PM1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,1)))
#define TSB_PM_FR1_PM2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,2)))
#define TSB_PM_FR1_PM3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,3)))
#define TSB_PM_FR1_PM4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,4)))
#define TSB_PM_FR1_PM5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,5)))
#define TSB_PM_FR1_PM6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,6)))
#define TSB_PM_FR1_PM7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR1 ,7)))
#define TSB_PM_FR2_PM0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR2 ,0)))
#define TSB_PM_FR2_PM1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR2 ,1)))
#define TSB_PM_FR2_PM2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR2 ,2)))
#define TSB_PM_FR2_PM3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR2 ,3)))
#define TSB_PM_FR3_PM0F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR3 ,0)))
#define TSB_PM_FR3_PM4F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->FR3 ,4)))
#define TSB_PM_OD_PM0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,0)))
#define TSB_PM_OD_PM1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,1)))
#define TSB_PM_OD_PM2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,2)))
#define TSB_PM_OD_PM3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,3)))
#define TSB_PM_OD_PM4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,4)))
#define TSB_PM_OD_PM5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,5)))
#define TSB_PM_OD_PM6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,6)))
#define TSB_PM_OD_PM7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->OD  ,7)))
#define TSB_PM_PUP_PM0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,0)))
#define TSB_PM_PUP_PM1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,1)))
#define TSB_PM_PUP_PM2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,2)))
#define TSB_PM_PUP_PM3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,3)))
#define TSB_PM_PUP_PM4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,4)))
#define TSB_PM_PUP_PM5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,5)))
#define TSB_PM_PUP_PM6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,6)))
#define TSB_PM_PUP_PM7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->PUP ,7)))
#define TSB_PM_IE_PM0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,0)))
#define TSB_PM_IE_PM1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,1)))
#define TSB_PM_IE_PM2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,2)))
#define TSB_PM_IE_PM3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,3)))
#define TSB_PM_IE_PM4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,4)))
#define TSB_PM_IE_PM5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,5)))
#define TSB_PM_IE_PM6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,6)))
#define TSB_PM_IE_PM7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PM->IE  ,7)))

/* General Purpose Input/Output Port (PN) */
#define TSB_PN_DATA_PN0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,0)))
#define TSB_PN_DATA_PN1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,1)))
#define TSB_PN_DATA_PN2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,2)))
#define TSB_PN_DATA_PN3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,3)))
#define TSB_PN_DATA_PN4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,4)))
#define TSB_PN_DATA_PN5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,5)))
#define TSB_PN_DATA_PN6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,6)))
#define TSB_PN_DATA_PN7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->DATA,7)))
#define TSB_PN_CR_PN0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,0)))
#define TSB_PN_CR_PN1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,1)))
#define TSB_PN_CR_PN2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,2)))
#define TSB_PN_CR_PN3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,3)))
#define TSB_PN_CR_PN4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,4)))
#define TSB_PN_CR_PN5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,5)))
#define TSB_PN_CR_PN6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,6)))
#define TSB_PN_CR_PN7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->CR  ,7)))
#define TSB_PN_FR1_PN0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,0)))
#define TSB_PN_FR1_PN1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,1)))
#define TSB_PN_FR1_PN2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,2)))
#define TSB_PN_FR1_PN3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,3)))
#define TSB_PN_FR1_PN4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,4)))
#define TSB_PN_FR1_PN5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,5)))
#define TSB_PN_FR1_PN6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,6)))
#define TSB_PN_FR1_PN7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR1 ,7)))
#define TSB_PN_FR2_PN2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2 ,2)))
#define TSB_PN_FR2_PN3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2 ,3)))
#define TSB_PN_FR2_PN6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2 ,6)))
#define TSB_PN_FR2_PN7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR2 ,7)))
#define TSB_PN_FR3_PN2F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR3 ,2)))
#define TSB_PN_FR3_PN3F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR3 ,3)))
#define TSB_PN_FR3_PN6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR3 ,6)))
#define TSB_PN_FR3_PN7F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->FR3 ,7)))
#define TSB_PN_OD_PN0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,0)))
#define TSB_PN_OD_PN1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,1)))
#define TSB_PN_OD_PN2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,2)))
#define TSB_PN_OD_PN3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,3)))
#define TSB_PN_OD_PN4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,4)))
#define TSB_PN_OD_PN5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,5)))
#define TSB_PN_OD_PN6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,6)))
#define TSB_PN_OD_PN7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->OD  ,7)))
#define TSB_PN_PUP_PN0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,0)))
#define TSB_PN_PUP_PN1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,1)))
#define TSB_PN_PUP_PN2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,2)))
#define TSB_PN_PUP_PN3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,3)))
#define TSB_PN_PUP_PN4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,4)))
#define TSB_PN_PUP_PN5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,5)))
#define TSB_PN_PUP_PN6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,6)))
#define TSB_PN_PUP_PN7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->PUP ,7)))
#define TSB_PN_IE_PN0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,0)))
#define TSB_PN_IE_PN1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,1)))
#define TSB_PN_IE_PN2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,2)))
#define TSB_PN_IE_PN3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,3)))
#define TSB_PN_IE_PN4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,4)))
#define TSB_PN_IE_PN5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,5)))
#define TSB_PN_IE_PN6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,6)))
#define TSB_PN_IE_PN7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PN->IE  ,7)))

