MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
#define TSB_TBF_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->EN  ,7)))
#define TSB_TBF_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->RUN ,0)))
#define TSB_TBF_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->RUN ,2)))
#define TSB_TBF_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->CR  ,3)))
#define TSB_TBF_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->CR  ,5)))
#define TSB_TBF_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->CR  ,7)))
#define TSB_TBF_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->MOD ,2)))
#define TSB_TBF_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBF->MOD ,5)))
#define TSB_TBF_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->FFCR,2)))
#define TSB_TBF_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->FFCR,3)))
#define TSB_TBF_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->FFCR,4)))
#define TSB_TBF_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->FFCR,5)))
#define TSB_TBF_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->IM  ,0)))
#define TSB_TBF_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->IM  ,1)))
#define TSB_TBF_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBF->IM  ,2)))


/* Serial Bus Interface (SBI) */
#define TSB_SBI0_CR0_SBIEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI0->CR0  ,7)))
#define TSB_SBI0_CR1_SWRMON                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->CR1  ,0)))
#define TSB_SBI0_I2CAR_ALS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI0->I2CAR,0)))
#define TSB_SBI0_SR_LRB                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,0)))
#define TSB_SBI0_SR_ADO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,1)))
#define TSB_SBI0_SR_AAS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,2)))
#define TSB_SBI0_SR_AL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,3)))
#define TSB_SBI0_SR_PIN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,4)))
#define TSB_SBI0_SR_BB                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,5)))
#define TSB_SBI0_SR_TRX                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,6)))
#define TSB_SBI0_SR_MST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,7)))
#define TSB_SBI0_BR0_I2SBI                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI0->BR0  ,6)))
#define TSB_SBI0_SR_SEF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,2)))
#define TSB_SBI0_SR_SIOF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI0->SR   ,3)))

#define TSB_SBI1_CR0_SBIEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI1->CR0  ,7)))
#define TSB_SBI1_CR1_SWRMON                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->CR1  ,0)))
#define TSB_SBI1_I2CAR_ALS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI1->I2CAR,0)))
#define TSB_SBI1_SR_LRB                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,0)))
#define TSB_SBI1_SR_ADO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,1)))
#define TSB_SBI1_SR_AAS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,2)))
#define TSB_SBI1_SR_AL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,3)))
#define TSB_SBI1_SR_PIN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,4)))
#define TSB_SBI1_SR_BB                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,5)))
#define TSB_SBI1_SR_TRX                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,6)))
#define TSB_SBI1_SR_MST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,7)))
#define TSB_SBI1_BR0_I2SBI                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI1->BR0  ,6)))
#define TSB_SBI1_SR_SEF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,2)))
#define TSB_SBI1_SR_SIOF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI1->SR   ,3)))

#define TSB_SBI2_CR0_SBIEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI2->CR0  ,7)))
#define TSB_SBI2_CR1_SWRMON                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->CR1  ,0)))
#define TSB_SBI2_I2CAR_ALS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI2->I2CAR,0)))
#define TSB_SBI2_SR_LRB                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,0)))
#define TSB_SBI2_SR_ADO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,1)))
#define TSB_SBI2_SR_AAS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,2)))
#define TSB_SBI2_SR_AL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,3)))
#define TSB_SBI2_SR_PIN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,4)))
#define TSB_SBI2_SR_BB                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,5)))
#define TSB_SBI2_SR_TRX                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,6)))
#define TSB_SBI2_SR_MST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,7)))
#define TSB_SBI2_BR0_I2SBI                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI2->BR0  ,6)))
#define TSB_SBI2_SR_SEF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,2)))
#define TSB_SBI2_SR_SIOF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI2->SR   ,3)))

#define TSB_SBI3_CR0_SBIEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI3->CR0  ,7)))
#define TSB_SBI3_CR1_SWRMON                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->CR1  ,0)))
#define TSB_SBI3_I2CAR_ALS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI3->I2CAR,0)))
#define TSB_SBI3_SR_LRB                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,0)))
#define TSB_SBI3_SR_ADO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,1)))
#define TSB_SBI3_SR_AAS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,2)))
#define TSB_SBI3_SR_AL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,3)))
#define TSB_SBI3_SR_PIN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,4)))
#define TSB_SBI3_SR_BB                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,5)))
#define TSB_SBI3_SR_TRX                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,6)))
#define TSB_SBI3_SR_MST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,7)))
#define TSB_SBI3_BR0_I2SBI                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI3->BR0  ,6)))
#define TSB_SBI3_SR_SEF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,2)))
#define TSB_SBI3_SR_SIOF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI3->SR   ,3)))

#define TSB_SBI4_CR0_SBIEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI4->CR0  ,7)))
#define TSB_SBI4_CR1_SWRMON                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->CR1  ,0)))
#define TSB_SBI4_I2CAR_ALS                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI4->I2CAR,0)))
#define TSB_SBI4_SR_LRB                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,0)))
#define TSB_SBI4_SR_ADO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,1)))
#define TSB_SBI4_SR_AAS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,2)))
#define TSB_SBI4_SR_AL                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,3)))
#define TSB_SBI4_SR_PIN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,4)))
#define TSB_SBI4_SR_BB                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,5)))
#define TSB_SBI4_SR_TRX                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,6)))
#define TSB_SBI4_SR_MST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,7)))
#define TSB_SBI4_BR0_I2SBI                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SBI4->BR0  ,6)))
#define TSB_SBI4_SR_SEF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,2)))
#define TSB_SBI4_SR_SIOF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SBI4->SR   ,3)))

/* Serial Channel (SC) */
#define TSB_SC0_EN_SIOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->EN  ,0)))
#define TSB_SC0_MOD0_WU                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD0,4)))
#define TSB_SC0_MOD0_RXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD0,5)))
#define TSB_SC0_MOD0_CTSE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD0,6)))
#define TSB_SC0_MOD0_TB8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD0,7)))
#define TSB_SC0_BRCR_BRADDE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->BRCR,6)))
#define TSB_SC0_MOD1_TXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD1,4)))
#define TSB_SC0_MOD1_I2SC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD1,7)))
#define TSB_SC0_MOD2_WBUF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,2)))
#define TSB_SC0_MOD2_DRCHG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,3)))
#define TSB_SC0_MOD2_SBLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,4)))
#define TSB_SC0_MOD2_TXRUN                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,5)))
#define TSB_SC0_MOD2_RBFLL                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,6)))
#define TSB_SC0_MOD2_TBEMP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC0->MOD2,7)))
#define TSB_SC0_RFC_RFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->RFC ,6)))
#define TSB_SC0_RFC_RFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC0->RFC ,7)))
#define TSB_SC0_TFC_TFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->TFC ,6)))
#define TSB_SC0_TFC_TFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC0->TFC ,7)))
#define TSB_SC0_RST_ROR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC0->RST ,7)))
#define TSB_SC0_TST_TUR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC0->TST ,7)))
#define TSB_SC0_FCNF_CNFG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->FCNF,0)))
#define TSB_SC0_FCNF_RXTXCNT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->FCNF,1)))
#define TSB_SC0_FCNF_RFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->FCNF,2)))
#define TSB_SC0_FCNF_TFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->FCNF,3)))
#define TSB_SC0_FCNF_RFST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC0->FCNF,4)))

#define TSB_SC1_EN_SIOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->EN  ,0)))
#define TSB_SC1_MOD0_WU                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD0,4)))
#define TSB_SC1_MOD0_RXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD0,5)))
#define TSB_SC1_MOD0_CTSE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD0,6)))
#define TSB_SC1_MOD0_TB8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD0,7)))
#define TSB_SC1_BRCR_BRADDE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->BRCR,6)))
#define TSB_SC1_MOD1_TXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD1,4)))
#define TSB_SC1_MOD1_I2SC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD1,7)))
#define TSB_SC1_MOD2_WBUF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,2)))
#define TSB_SC1_MOD2_DRCHG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,3)))
#define TSB_SC1_MOD2_SBLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,4)))
#define TSB_SC1_MOD2_TXRUN                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,5)))
#define TSB_SC1_MOD2_RBFLL                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,6)))
#define TSB_SC1_MOD2_TBEMP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC1->MOD2,7)))
#define TSB_SC1_RFC_RFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->RFC ,6)))
#define TSB_SC1_RFC_RFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC1->RFC ,7)))
#define TSB_SC1_TFC_TFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->TFC ,6)))
#define TSB_SC1_TFC_TFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC1->TFC ,7)))
#define TSB_SC1_RST_ROR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC1->RST ,7)))
#define TSB_SC1_TST_TUR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC1->TST ,7)))
#define TSB_SC1_FCNF_CNFG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->FCNF,0)))
#define TSB_SC1_FCNF_RXTXCNT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->FCNF,1)))
#define TSB_SC1_FCNF_RFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->FCNF,2)))
#define TSB_SC1_FCNF_TFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->FCNF,3)))
#define TSB_SC1_FCNF_RFST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC1->FCNF,4)))

#define TSB_SC2_EN_SIOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->EN  ,0)))
#define TSB_SC2_MOD0_WU                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,4)))
#define TSB_SC2_MOD0_RXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,5)))
#define TSB_SC2_MOD0_CTSE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,6)))
#define TSB_SC2_MOD0_TB8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD0,7)))
#define TSB_SC2_BRCR_BRADDE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->BRCR,6)))
#define TSB_SC2_MOD1_TXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD1,4)))
#define TSB_SC2_MOD1_I2SC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD1,7)))
#define TSB_SC2_MOD2_WBUF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,2)))
#define TSB_SC2_MOD2_DRCHG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,3)))
#define TSB_SC2_MOD2_SBLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,4)))
#define TSB_SC2_MOD2_TXRUN                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,5)))
#define TSB_SC2_MOD2_RBFLL                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,6)))
#define TSB_SC2_MOD2_TBEMP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->MOD2,7)))
#define TSB_SC2_RFC_RFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->RFC ,6)))
#define TSB_SC2_RFC_RFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC2->RFC ,7)))
#define TSB_SC2_TFC_TFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->TFC ,6)))
#define TSB_SC2_TFC_TFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC2->TFC ,7)))
#define TSB_SC2_RST_ROR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->RST ,7)))
#define TSB_SC2_TST_TUR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC2->TST ,7)))
#define TSB_SC2_FCNF_CNFG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,0)))
#define TSB_SC2_FCNF_RXTXCNT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,1)))
#define TSB_SC2_FCNF_RFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,2)))
#define TSB_SC2_FCNF_TFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,3)))
#define TSB_SC2_FCNF_RFST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC2->FCNF,4)))

