MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
#define TSB_SC8_EN_SIOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->EN  ,0)))
#define TSB_SC8_MOD0_WU                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,4)))
#define TSB_SC8_MOD0_RXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,5)))
#define TSB_SC8_MOD0_CTSE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,6)))
#define TSB_SC8_MOD0_TB8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD0,7)))
#define TSB_SC8_BRCR_BRADDE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->BRCR,6)))
#define TSB_SC8_MOD1_TXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD1,4)))
#define TSB_SC8_MOD1_I2SC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD1,7)))
#define TSB_SC8_MOD2_WBUF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,2)))
#define TSB_SC8_MOD2_DRCHG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,3)))
#define TSB_SC8_MOD2_SBLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,4)))
#define TSB_SC8_MOD2_TXRUN                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,5)))
#define TSB_SC8_MOD2_RBFLL                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,6)))
#define TSB_SC8_MOD2_TBEMP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->MOD2,7)))
#define TSB_SC8_RFC_RFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->RFC ,6)))
#define TSB_SC8_RFC_RFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC8->RFC ,7)))
#define TSB_SC8_TFC_TFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->TFC ,6)))
#define TSB_SC8_TFC_TFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC8->TFC ,7)))
#define TSB_SC8_RST_ROR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->RST ,7)))
#define TSB_SC8_TST_TUR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC8->TST ,7)))
#define TSB_SC8_FCNF_CNFG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,0)))
#define TSB_SC8_FCNF_RXTXCNT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,1)))
#define TSB_SC8_FCNF_RFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,2)))
#define TSB_SC8_FCNF_TFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,3)))
#define TSB_SC8_FCNF_RFST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC8->FCNF,4)))

#define TSB_SC9_EN_SIOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->EN  ,0)))
#define TSB_SC9_MOD0_WU                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,4)))
#define TSB_SC9_MOD0_RXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,5)))
#define TSB_SC9_MOD0_CTSE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,6)))
#define TSB_SC9_MOD0_TB8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD0,7)))
#define TSB_SC9_BRCR_BRADDE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->BRCR,6)))
#define TSB_SC9_MOD1_TXE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD1,4)))
#define TSB_SC9_MOD1_I2SC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD1,7)))
#define TSB_SC9_MOD2_WBUF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,2)))
#define TSB_SC9_MOD2_DRCHG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,3)))
#define TSB_SC9_MOD2_SBLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,4)))
#define TSB_SC9_MOD2_TXRUN                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,5)))
#define TSB_SC9_MOD2_RBFLL                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,6)))
#define TSB_SC9_MOD2_TBEMP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->MOD2,7)))
#define TSB_SC9_RFC_RFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->RFC ,6)))
#define TSB_SC9_RFC_RFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC9->RFC ,7)))
#define TSB_SC9_TFC_TFIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->TFC ,6)))
#define TSB_SC9_TFC_TFCS                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC9->TFC ,7)))
#define TSB_SC9_RST_ROR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->RST ,7)))
#define TSB_SC9_TST_TUR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC9->TST ,7)))
#define TSB_SC9_FCNF_CNFG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,0)))
#define TSB_SC9_FCNF_RXTXCNT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,1)))
#define TSB_SC9_FCNF_RFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,2)))
#define TSB_SC9_FCNF_TFIE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,3)))
#define TSB_SC9_FCNF_RFST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC9->FCNF,4)))

#define TSB_SC10_EN_SIOE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->EN  ,0)))
#define TSB_SC10_MOD0_WU                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,4)))
#define TSB_SC10_MOD0_RXE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,5)))
#define TSB_SC10_MOD0_CTSE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,6)))
#define TSB_SC10_MOD0_TB8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD0,7)))
#define TSB_SC10_BRCR_BRADDE                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->BRCR,6)))
#define TSB_SC10_MOD1_TXE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD1,4)))
#define TSB_SC10_MOD1_I2SC                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD1,7)))
#define TSB_SC10_MOD2_WBUF                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,2)))
#define TSB_SC10_MOD2_DRCHG                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,3)))
#define TSB_SC10_MOD2_SBLEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,4)))
#define TSB_SC10_MOD2_TXRUN                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,5)))
#define TSB_SC10_MOD2_RBFLL                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,6)))
#define TSB_SC10_MOD2_TBEMP                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->MOD2,7)))
#define TSB_SC10_RFC_RFIS                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->RFC ,6)))
#define TSB_SC10_RFC_RFCS                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC10->RFC ,7)))
#define TSB_SC10_TFC_TFIS                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->TFC ,6)))
#define TSB_SC10_TFC_TFCS                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC10->TFC ,7)))
#define TSB_SC10_RST_ROR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->RST ,7)))
#define TSB_SC10_TST_TUR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC10->TST ,7)))
#define TSB_SC10_FCNF_CNFG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,0)))
#define TSB_SC10_FCNF_RXTXCNT                (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,1)))
#define TSB_SC10_FCNF_RFIE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,2)))
#define TSB_SC10_FCNF_TFIE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,3)))
#define TSB_SC10_FCNF_RFST                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC10->FCNF,4)))

#define TSB_SC11_EN_SIOE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->EN  ,0)))
#define TSB_SC11_MOD0_WU                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD0,4)))
#define TSB_SC11_MOD0_RXE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD0,5)))
#define TSB_SC11_MOD0_CTSE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD0,6)))
#define TSB_SC11_MOD0_TB8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD0,7)))
#define TSB_SC11_BRCR_BRADDE                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->BRCR,6)))
#define TSB_SC11_MOD1_TXE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD1,4)))
#define TSB_SC11_MOD1_I2SC                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD1,7)))
#define TSB_SC11_MOD2_WBUF                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,2)))
#define TSB_SC11_MOD2_DRCHG                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,3)))
#define TSB_SC11_MOD2_SBLEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,4)))
#define TSB_SC11_MOD2_TXRUN                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,5)))
#define TSB_SC11_MOD2_RBFLL                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,6)))
#define TSB_SC11_MOD2_TBEMP                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC11->MOD2,7)))
#define TSB_SC11_RFC_RFIS                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->RFC ,6)))
#define TSB_SC11_RFC_RFCS                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC11->RFC ,7)))
#define TSB_SC11_TFC_TFIS                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->TFC ,6)))
#define TSB_SC11_TFC_TFCS                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_SC11->TFC ,7)))
#define TSB_SC11_RST_ROR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC11->RST ,7)))
#define TSB_SC11_TST_TUR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_SC11->TST ,7)))
#define TSB_SC11_FCNF_CNFG                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->FCNF,0)))
#define TSB_SC11_FCNF_RXTXCNT                (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->FCNF,1)))
#define TSB_SC11_FCNF_RFIE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->FCNF,2)))
#define TSB_SC11_FCNF_TFIE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->FCNF,3)))
#define TSB_SC11_FCNF_RFST                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_SC11->FCNF,4)))

/* Consumer Electronics Control (CEC) */
#define TSB_CEC_EN_CECEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->EN   ,0)))
#define TSB_CEC_EN_I2CEC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->EN   ,1)))
#define TSB_CEC_RESET_CECRESET               (*((__O  uint32_t *)BITBAND_PERI(&TSB_CEC->RESET,0)))
#define TSB_CEC_REN_CECREN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->REN  ,0)))
#define TSB_CEC_RBUF_CECEOM                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RBUF ,8)))
#define TSB_CEC_RBUF_CECACK                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RBUF ,9)))
#define TSB_CEC_RCR1_CECOTH                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->RCR1 ,0)))
#define TSB_CEC_RCR1_CECRIHLD                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->RCR1 ,1)))
#define TSB_CEC_RCR1_CECACKDIS               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->RCR1 ,24)))
#define TSB_CEC_RCR3_CECWAVEN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->RCR3 ,0)))
#define TSB_CEC_RCR3_CECRSTAEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->RCR3 ,1)))
#define TSB_CEC_TEN_CECTEN                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_CEC->TEN  ,0)))
#define TSB_CEC_TEN_CECTRANS                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TEN  ,1)))
#define TSB_CEC_TBUF_CECTEOM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->TBUF ,8)))
#define TSB_CEC_TCR_CECBRD                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->TCR  ,4)))
#define TSB_CEC_RSTAT_CECRIEND               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,0)))
#define TSB_CEC_RSTAT_CECRISTA               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,1)))
#define TSB_CEC_RSTAT_CECRIMAX               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,2)))
#define TSB_CEC_RSTAT_CECRIMIN               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,3)))
#define TSB_CEC_RSTAT_CECRIACK               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,4)))
#define TSB_CEC_RSTAT_CECRIOR                (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,5)))
#define TSB_CEC_RSTAT_CECRIWAV               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->RSTAT,6)))
#define TSB_CEC_TSTAT_CECTISTA               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TSTAT,0)))
#define TSB_CEC_TSTAT_CECTIEND               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TSTAT,1)))
#define TSB_CEC_TSTAT_CECTIAL                (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TSTAT,2)))
#define TSB_CEC_TSTAT_CECTIACK               (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TSTAT,3)))
#define TSB_CEC_TSTAT_CECTIUR                (*((__I  uint32_t *)BITBAND_PERI(&TSB_CEC->TSTAT,4)))
#define TSB_CEC_FSSEL_CECCLK                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CEC->FSSEL,0)))

