MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* Remote Control Signal Preprocessor (RMC) */
#define TSB_RMC0_EN_RMCEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->EN   ,0)))
#define TSB_RMC0_EN_I2RMC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->EN   ,1)))
#define TSB_RMC0_REN_RMCREN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->REN  ,0)))
#define TSB_RMC0_RCR2_RMCPHM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,24)))
#define TSB_RMC0_RCR2_RMCLD                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,25)))
#define TSB_RMC0_RCR2_RMCEDIEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,30)))
#define TSB_RMC0_RCR2_RMCLIEN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,31)))
#define TSB_RMC0_RCR4_RMCPO                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR4 ,7)))
#define TSB_RMC0_RSTAT_RMCRLDR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,7)))
#define TSB_RMC0_RSTAT_RMCEDIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,12)))
#define TSB_RMC0_RSTAT_RMCDMAXIF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,13)))
#define TSB_RMC0_RSTAT_RMCLOIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,14)))
#define TSB_RMC0_RSTAT_RMCRLIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,15)))
#define TSB_RMC0_FSSEL_RMCCLK                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->FSSEL,0)))

#define TSB_RMC1_EN_RMCEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->EN   ,0)))
#define TSB_RMC1_EN_I2RMC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->EN   ,1)))
#define TSB_RMC1_REN_RMCREN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->REN  ,0)))
#define TSB_RMC1_RCR2_RMCPHM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,24)))
#define TSB_RMC1_RCR2_RMCLD                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,25)))
#define TSB_RMC1_RCR2_RMCEDIEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,30)))
#define TSB_RMC1_RCR2_RMCLIEN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,31)))
#define TSB_RMC1_RCR4_RMCPO                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR4 ,7)))
#define TSB_RMC1_RSTAT_RMCRLDR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,7)))
#define TSB_RMC1_RSTAT_RMCEDIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,12)))
#define TSB_RMC1_RSTAT_RMCDMAXIF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,13)))
#define TSB_RMC1_RSTAT_RMCLOIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,14)))
#define TSB_RMC1_RSTAT_RMCRLIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,15)))
#define TSB_RMC1_FSSEL_RMCCLK                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->FSSEL,0)))

/* Analog-to-Digital Converter (AD) */
#define TSB_AD_MOD0_ADS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,0)))
#define TSB_AD_MOD0_SCAN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,1)))
#define TSB_AD_MOD0_REPEAT                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,2)))
#define TSB_AD_MOD0_ADBFN                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,6)))
#define TSB_AD_MOD0_EOCFN                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,7)))
#define TSB_AD_MOD1_ADSCN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,5)))
#define TSB_AD_MOD1_I2AD                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,6)))
#define TSB_AD_MOD1_VREFON                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,7)))
#define TSB_AD_MOD2_HPADCE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,5)))
#define TSB_AD_MOD2_ADBFHP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,6)))
#define TSB_AD_MOD2_EOCFHP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,7)))
#define TSB_AD_MOD3_ADOBSV0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3 ,0)))
#define TSB_AD_MOD3_ADOBIC0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3 ,5)))
#define TSB_AD_MOD5_ADOBSV1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5 ,0)))
#define TSB_AD_MOD5_ADOBIC1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5 ,5)))
#define TSB_AD_REG08_ADR0RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,0)))
#define TSB_AD_REG08_OVR0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,1)))
#define TSB_AD_REG19_ADR1RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG19,0)))
#define TSB_AD_REG19_OVR1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG19,1)))
#define TSB_AD_REG2A_ADR2RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG2A,0)))
#define TSB_AD_REG2A_OVR2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG2A,1)))
#define TSB_AD_REG3B_ADR3RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG3B,0)))
#define TSB_AD_REG3B_OVR3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG3B,1)))
#define TSB_AD_REG4C_ADR4RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG4C,0)))
#define TSB_AD_REG4C_OVR4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG4C,1)))
#define TSB_AD_REG5D_ADR5RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG5D,0)))
#define TSB_AD_REG5D_OVR5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG5D,1)))
#define TSB_AD_REG6E_ADR6RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG6E,0)))
#define TSB_AD_REG6E_OVR6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG6E,1)))
#define TSB_AD_REG7F_ADR7RF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG7F,0)))
#define TSB_AD_REG7F_OVR7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG7F,1)))
#define TSB_AD_REGSP_ADRSPRF                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,0)))
#define TSB_AD_REGSP_OVRSP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,1)))

