MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM363F10FG/mcu.h
/* Key on Wake Up (KWUP) */
#define TSB_KWUP_CR0_KEY0EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR0 ,0)))
#define TSB_KWUP_CR0_DPE0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR0 ,7)))
#define TSB_KWUP_CR1_KEY1EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR1 ,0)))
#define TSB_KWUP_CR1_DPE1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR1 ,7)))
#define TSB_KWUP_CR2_KEY2EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR2 ,0)))
#define TSB_KWUP_CR2_DPE2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR2 ,7)))
#define TSB_KWUP_CR3_KEY3EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR3 ,0)))
#define TSB_KWUP_CR3_DPE3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR3 ,7)))
#define TSB_KWUP_PKEY_PKEY0                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,0)))
#define TSB_KWUP_PKEY_PKEY1                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,1)))
#define TSB_KWUP_PKEY_PKEY2                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,2)))
#define TSB_KWUP_PKEY_PKEY3                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,3)))
#define TSB_KWUP_INT_KEYINT0                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,0)))
#define TSB_KWUP_INT_KEYINT1                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,1)))
#define TSB_KWUP_INT_KEYINT2                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,2)))
#define TSB_KWUP_INT_KEYINT3                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,3)))

/* Watchdog Timer (WD) */
#define TSB_WD_MOD_RESCR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))

/* Real Time Clock (RTC) */
#define TSB_RTC_MONTHR_MO0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_RTC->MONTHR,0)))

/* Clock Generator (CG) */
#define TSB_CG_SYSCR_FPSEL0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR ,12)))
#define TSB_CG_SYSCR_FPSEL1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR ,13)))
#define TSB_CG_SYSCR_FCSTOP                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR ,20)))
#define TSB_CG_OSCCR_WUEON                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,0)))
#define TSB_CG_OSCCR_WUEF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,1)))
#define TSB_CG_OSCCR_PLLON                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,2)))
#define TSB_CG_OSCCR_WUPSEL                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,3)))
#define TSB_CG_OSCCR_XEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,8)))
#define TSB_CG_OSCCR_XTEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR ,9)))
#define TSB_CG_STBYCR_RXEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,8)))
#define TSB_CG_STBYCR_RXTEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,9)))
#define TSB_CG_STBYCR_DRVE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,16)))
#define TSB_CG_STBYCR_PTKEEP                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,17)))
#define TSB_CG_PLLSEL_PLLSEL                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,0)))
#define TSB_CG_PLLSEL_C2S                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,8)))
#define TSB_CG_CKSEL_SYSCKFLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->CKSEL ,0)))
#define TSB_CG_CKSEL_SYSCK                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->CKSEL ,1)))
#define TSB_CG_RSTFLG_PONRSTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,0)))
#define TSB_CG_RSTFLG_PINRSTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,1)))
#define TSB_CG_RSTFLG_WDTRSTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,2)))
#define TSB_CG_RSTFLG_BUPRSTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,3)))
#define TSB_CG_RSTFLG_SYSRSTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,4)))
#define TSB_CG_IMCGA_INT0EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA ,0)))
#define TSB_CG_IMCGA_INT1EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA ,8)))
#define TSB_CG_IMCGA_INT2EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA ,16)))
#define TSB_CG_IMCGA_INT3EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA ,24)))
#define TSB_CG_IMCGB_INT4EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB ,0)))
#define TSB_CG_IMCGB_INT5EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB ,8)))
#define TSB_CG_IMCGB_INT6EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB ,16)))
#define TSB_CG_IMCGB_INT7EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB ,24)))
#define TSB_CG_IMCGC_INT8EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC ,0)))
#define TSB_CG_IMCGC_INT9EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC ,8)))
#define TSB_CG_IMCGC_INTAEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC ,16)))
#define TSB_CG_IMCGC_INTBEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC ,24)))
#define TSB_CG_IMCGD_INTCEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD ,0)))
#define TSB_CG_IMCGD_INTDEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD ,8)))
#define TSB_CG_IMCGD_INTEEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD ,16)))
#define TSB_CG_IMCGD_INTFEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD ,24)))
#define TSB_CG_IMCGE_INTGEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGE ,0)))
#define TSB_CG_IMCGE_INTHEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGE ,8)))
#define TSB_CG_IMCGE_INTIEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGE ,16)))
#define TSB_CG_IMCGE_INTJEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGE ,24)))
#define TSB_CG_IMCGF_INTKEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGF ,0)))
#define TSB_CG_IMCGF_INTLEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGF ,8)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM363_H__ */

/** @} */ /* End of group TMPM363 */
/** @} */ /* End of group TOSHIBA_TX03_MICROCONTROLLER */
